{"schedule":{"version":"test","base_url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/","conference":{"acronym":"rc3","title":"Remote Chaos Experience","start":"2020-12-27","end":"2020-12-30","daysCount":4,"timeslot_duration":"00:10","time_zone_name":"Europe/Berlin","days":[{"index":1,"date":"2020-12-27","day_start":"2020-12-27T09:00:00+01:00","day_end":"2020-12-28T04:00:00+01:00","rooms":{"rc1":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11583.html","id":11583,"guid":"090c24b4-34c9-432c-a848-41150439f8c9","logo":null,"date":"2020-12-27T12:20:00+01:00","start":"12:20","duration":"00:30","room":"rc1","slug":"rc3-11583-rc3_eroffnung","title":"#rC3 Eröffnung","subtitle":"","track":"Community","type":"lecture","language":"de","abstract":"Willkommen zur ersten und hoffentlich einzigen Remote Chaos Experience!","description":"","recording_license":"","do_not_record":false,"persons":[{"id":14151,"public_name":"blubbel"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11503.html","id":11503,"guid":"c7fd5bd1-3f68-48e9-adba-a8161c777a69","logo":null,"date":"2020-12-27T13:00:00+01:00","start":"13:00","duration":"00:40","room":"rc1","slug":"rc3-11503-the_mission_of_the_mv_louise_michel","title":"The Mission of the MV Louise Michel","subtitle":"\"Feminism will be anti-racist or it won´t be\"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"SAR for us does not mean “Search and Rescue\", but “Solidarity and Resistance”. We will talk about the mission of the rescue vessel Louise Michel and why smashing borders won´t work without smashing the patriarchy - and the other way round. \r\n","description":"This summer, a pink ship popped up on the central mediterranean sea and made headlines by rescuing hundreds out of maritime distress. We will talk about the power structures behind this situation and about the values of our mission as we understand doing sea rescue not as an humanitarian act but as field that might conquer powerful relations. \r\n\r\nBorders are imaginary lines with a pronounced vulnerability, otherwise they would not need so many (technical) measures to protect them. \r\nBut borders are more than 'only' borders of states/countries. Borders are also boundaries between humans, bodies, gender, ... or differently: they are supposed lines of distinction. Fighting these borders means we have to struggle them together and understand all of them as contested territories, contested bodies, contested spaces. \r\n\r\nBut what could that mean? And (how) do we reflect what we’re doing and how we’re acting? How aware are we ourselves about white supremacy and neo-colonialism in our work? How can we challenge our internalized sexism and racism while working in the field under constant pressure of opressing systems? \r\n","recording_license":"","do_not_record":false,"persons":[{"id":12812,"public_name":"MVLouise Michel"}],"links":[{"url":"https://mvlouisemichel.org/","title":"MV Louise Michel "}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11512.html","id":11512,"guid":"52f30691-75bc-4759-94a5-ce2225c1e849","logo":null,"date":"2020-12-27T14:00:00+01:00","start":"14:00","duration":"00:40","room":"rc1","slug":"rc3-11512-cia_vs_wikileaks","title":"CIA vs. Wikileaks","subtitle":"Intimiditation surveillance and other tactics observed and experienced","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"In this talk, I aim to report and show a collection of observations, physical, visual and other evidence of the last years incidents that strongly indicate a context of the US Central Intelligence Agency and/or potentially other entities of the US Government actions against Wikileaks and surrounding persons and organisations.","description":"While the area of technical surveillance, SIGINT/COMINT and related Organizations and Methods have been more or less well understood in the hacker scene, the tactics and methods experienced and discussed in this talk are of a different type: For the moment, I would call it \"initimidation surveillance\" as it lacks the aspect of \"covert\" type of actions.\r\n\r\nOn the last Chaos Communication Congress, I have analysed the technical aspects of the surveillance in and surrounding the ecuadorian embassy where Julian Assange stayed; this talk shows what happened to other people - friends of Assange, supporters of Wikileaks etc - not only in England, but also in other countries / other parts of the world. \r\n\r\nThe idea is to not only show the scope of activities but also to contribute to a better understanding of these tactics, that might be applied also in completely different political environments where governments act in extralegal ways against activities they dislike, although they that are not a crime or easily criminalized.","recording_license":"","do_not_record":false,"persons":[{"id":1752,"public_name":"andy"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11486.html","id":11486,"guid":"78339cc8-3225-47d0-81d7-e5b5d15d15b6","logo":null,"date":"2020-12-27T15:00:00+01:00","start":"15:00","duration":"01:00","room":"rc1","slug":"rc3-11486-das_assange-auslieferungsverfahren","title":"Das Assange-Auslieferungsverfahren ","subtitle":"Als Prozessbeobachter in London","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Die USA hat im Vereinigten Königreich die Auslieferung von Julian Assange beantragt. Dazu fanden dieses Jahr zwei Prozessblöcke statt, die ich beide in London als politischer Beobachter verfolgt habe. Davon werde ich berichten.","description":"Im Februar und im September wurde insgesamt gut fünf Wochen lang über die mögliche Auslieferung von Julian Assange verhandelt. Inzwischen liegen gut 400 Seiten Abschlussstatements beider Parteien vor und für den 04.01.2021 hat die Richterin die Verkündung einer Entscheidung angekündigt. \r\n\r\nIm Vortrag möchte ich einen Eindruck davon vermitteln, wie das Verfahren abgelaufen ist, welche Akteure vor Ort aufgetreten sind, welche Punkte diskutiert wurden und ob diese einer Auslieferung entgegenstehen könnten.\r\n","recording_license":"","do_not_record":false,"persons":[{"id":8729,"public_name":"Dustin Hoffmann"}],"links":[{"url":"https://www.youtube.com/c/DustinHoffmann","title":"YouTube-Kanal zum Prozess"},{"url":"https://logbuch-netzpolitik.de/lnp364-der-fall-assange","title":"Ausführliches Podcast-Interview über den Prozess"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11378.html","id":11378,"guid":"1f782473-6e96-4b75-a98e-4031bffea2c0","logo":null,"date":"2020-12-27T18:00:00+01:00","start":"18:00","duration":"00:40","room":"rc1","slug":"rc3-11378-exposure_notification_security","title":"Exposure Notification Security","subtitle":"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"Bluetooth is still the best technology we have in a smartphone to implement exposure notifications. It is safe to use the Corona-Warn-App. Fight me! ;)","description":"Wait, what, did Jiska just submit a talk claiming that Bluetooth is secure?! Is this just another 2020 plot twist?\r\n\r\nNo, it's not. Assuming that we need an app that enables exposure notifications based on distance measurements, Bluetooth is the best trade-off. Audio would be more accurate but requires permanent access to the microphone. GPS does not work indoors, Wi-Fi and LTE chips are less accessible through smartphone APIs, so we're left with Bluetooth. And Bluetooth LE Advertisements are actually a great choice for such a protocol, further reducing exploitability.\r\n\r\nAs someone who was involved in finding multiple Bluetooth security issues within chips and operating systems, Jiska should be more afraid of Bluetooth, you might think. However, attacking Bluetooth on an up-to-date smartphone with recent chips is very complex and requires physical proximity. Those using outdated smartphones face similar risks when browsing the Internet, without the physical proximity requirement.\r\n\r\nThere are other issues within the CWA, such as missing awareness of places like restaurants and public transport, and a health system that lacks fast test reports. We should care about real problems instead of claiming security issues that barely have an impact on average users.","recording_license":"","do_not_record":false,"persons":[{"id":4927,"public_name":"jiska"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11337.html","id":11337,"guid":"0d268ba5-3810-42fd-9d86-cfc0571a38d5","logo":null,"date":"2020-12-27T19:00:00+01:00","start":"19:00","duration":"00:40","room":"rc1","slug":"rc3-11337-what_the_cyberoptimists_got_wrong_-_and_what_to_do_about_it","title":"What the cyberoptimists got wrong - and what to do about it","subtitle":"Tech unexeptionalism and the monopolization of every goddamned thing","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"They stole our future. Let's take it back.","description":"Here at the end of the world, it's time to take stock. Is technology a force for good? Can it be? Was it ever? How did we end up with a world made up of \"five websites, each filled with screenshots of text from the other four\" (h/t Tom Eastman)? Should we worry that machine learning will take away our free will through A/B splitting and Big Five Personality Types? Where the fuck did all these Nazis come from? ","recording_license":"","do_not_record":false,"persons":[{"id":3266,"public_name":"doctorow"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11440.html","id":11440,"guid":"c2c3752a-f3c0-4e3f-b619-15ad7749f156","logo":"/system/events/logos/000/011/440/large/path1129-3-1-8-5-5-4-1-0-1.png?1605890982","date":"2020-12-27T20:00:00+01:00","start":"20:00","duration":"01:00","room":"rc1","slug":"rc3-11440-hacking_german_elections","title":"Hacking German Elections","subtitle":"Insecure Electronic Vote Counting - How It Returned and Why You Don't Even Know About It","track":"IT-Security","type":"lecture","language":"en","abstract":"After the first unsuccessful deployment of voting machines in Germany about ten years ago, elements of electronic voting have reached elections again. Although there is now still a paper-trail, more and more essential steps, such as counting the votes, are moved into electronic systems. This change in the ballot-counting procedure took place mostly unnoticed by the public. We are two very concerned election workers who present our first-hand experience in this talk. We show that the current digital procedure is conceptually and practically flawed in terms of security. First, we give an insight into the role of computers and their interaction with humans during ballot-counting. We show that the underlying system concepts contradict IT-security best-practices. Next, we present an in-depth analysis of one ballot-counting software, deployed for the Bavarian municipal elections (\"Kommunalwahlen\"). We discovered several severe security vulnerabilities that allow an almost unnoticeable manipulation of local voting results. Finally, we conclude that there is an immediate need for action to re-establish election security and transparency - not only for the government but for everyone of us.","description":"Elections are a key element of every democracy. However, many democratic countries in the world have to face attacks on them, be it by the government or by foreign countries. Even if ballot counting has been finished, election results are often not accepted but questioned due to alleged manipulations. All these aspects pose major threats to democracy as they try to undermine the actual and publicly perceived integrity of elections.\r\n\r\nIn Germany, elections are usually considered quite secure. Elections are paper-based and the subsequent ballot-counting is open to the public. The infamous introduction of electronic voting machines about ten years ago was finally stopped by the German Federal Constitutional Court. Thus, everything is human-controlled, transparent, and secure – isn’t it?\r\n\r\nUnfortunately, these claims are questionable since the silent introduction of electronic vote counting. The election system in Germany is quite complex, for example in the \"Kreistagswahlen\" (~district elections) workers have to count up to 70 individual votes per ballot, while respecting a special rule set. This process is very labor-intensive and sufficient election workers are often hard to come by. Due to this, electronic systems were introduced that provide support during vote counting. Election workers are no longer required to fill tally sheets, count votes, and sum them up on their own. Each ballot is simply entered into a software that performs all the magic and finally emits a result.\r\n\r\nThis year, we volunteered again as election workers, but our trust in electronically-assisted elections has been vastly impacted. As IT-security researchers, we consider it our responsibility to share and discuss our concerns. We performed a thorough analysis of the concept and the hard- and software of the electronic vote counting system. We discovered several flaws on a conceptual and practical level, that can severely diminish the integrity of the election and makes it prone to manipulations. To underline the impact of the system’s vulnerabilities, we demonstrate an exemplary attack on an election.\r\n\r\nFinally, we propose different options on how to make elections secure again. We do not consider this an entirely technical case, as there are significant legal and societal circumstances that led to the deployment of this insecure system.","recording_license":"","do_not_record":false,"persons":[{"id":9019,"public_name":"Johannes"},{"id":12799,"public_name":"Tobaem"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11568.html","id":11568,"guid":"ea519362-d698-42d8-b098-5e84d661c306","logo":null,"date":"2020-12-27T21:20:00+01:00","start":"21:20","duration":"01:00","room":"rc1","slug":"rc3-11568-the_yes_men_from_tricksters_in_an_age_of_dirty_tricks","title":"The Yes Men from Tricksters in an age of dirty tricks","subtitle":"","track":"Art \u0026 Culture","type":"lecture","language":"en","abstract":"Surprise from The one and only Yes Men","description":"","recording_license":"","do_not_record":false,"persons":[{"id":13227,"public_name":"Yes Men"}],"links":[{"url":"https://theyesmen.org","title":"The Yes Men"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11595.html","id":11595,"guid":"c9923806-0eeb-4576-a9d4-ee3f33a6b5d0","logo":null,"date":"2020-12-27T22:30:00+01:00","start":"22:30","duration":"00:30","room":"rc1","slug":"rc3-11595-lesung_qualityland_2_0","title":"Lesung: Qualityland 2.0","subtitle":"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Schwer was los in QualityLand, dem besten aller möglichen Länder. ","description":"Jeder Monat ist der heißeste seit Beginn der Wetteraufzeichnung, ein Billionär möchte Präsident werden, und dann ist da noch die Sache mit dem Dritten Weltkrieg. Peter Arbeitsloser darf derweil endlich als Maschinentherapeut arbeiten und versucht, die Beziehungsprobleme von Haushaltsgeräten zu lösen. Kiki Unbekannt schnüffelt in ihrer eigenen Vergangenheit herum und bekommt Stress mit einem ferngesteuerten Killer. Außerdem benehmen sich alle Drohnen in letzter Zeit ziemlich sonderbar... ","recording_license":"","do_not_record":false,"persons":[{"id":7987,"public_name":"Marc-Uwe Kling"}],"links":[],"attachments":[]}],"rc2":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11560.html","id":11560,"guid":"b4cb2164-52b4-4f81-a3cc-8d6b60e7e99e","logo":null,"date":"2020-12-27T13:00:00+01:00","start":"13:00","duration":"00:40","room":"rc2","slug":"rc3-11560-boiling_mind","title":"Boiling Mind","subtitle":"Analysing the link between audience physiology and choreography","track":"Art \u0026 Culture","type":"lecture","language":"en","abstract":"The role of the audience in stage performances is changing from passive spectators to contributors making the performance interactive by using different techniques. In this talk, we investigate the connection of audience physiological data to the experienced performance in three performance events with a total of 98 participants. We identified memorable performance moments by assessing, Electrodermal Activity (EDA) showing that the audience’s responses match the choreographer’s intention. Through Heart Rate Variability (HRV) features related to parasympathetic activity, we identified dramatic shifts that are connected to the choreographic development of the performance. Our results show how the audience's physiological responses are linked to the choreographic development of the performance. Based on the findings, we contribute a discussion of the registered physiological phenomena and implications of the audience’s responses analysis to performance and choreography design in general. Furthermore, we walk through the dataset collected from the performance events. ","description":"Each performance lives from the interplay between audience and artists. Even if performers follow a precise script, each rendition is different partly due to audience reactions. Performers often describe it as an invisible link between then and the spectators, involving the audience in co-creating art. \r\n\r\nThe stage design and described setup came out of a collaboration between the performing artists, designers and researchers in a semi-democratic process.\r\n\r\nBoth researchers and artists contributed to developing the concept during the iterative process to balance research and artistic interests. This process was mainly led by artists, especially the choreographer. Besides the predetermined story and design, the choreographer also created some improvisational sections where dancers could interact with stage elements affected by audience physiological response.\r\n\r\nThe main contributions of this talk are as follows:\r\n(1) We present the concept of \"bringing the audience on stage\" by mapping physiological signals from audience members to stage elements to amplify the connection between artists and the audience. We detail information about the design process, focusing on sensing heart rate and electrodermal activity (EDA), as well as how these signals are translated to the onstage elements through sonification and visualizations.\r\n(2) We describe an open integrated wearable system that consists of a wrist band, back-end processing, and output. Our proposed system enables the capturing and translating of physiological signals into stage design elements.\r\n(3) We realized our proposed concept as a proof-of-concept with the performance \"Boiling Mind\". The performance involved dancers, choreographers, researchers, visual and sound designers in the process. It was performed three times in front of an audience of 57, 37 and 45 people. In each performance, around 30 audience members wore the wearable wrist bands.\r\n\r\nThe hardware used for the performance piece as well as the data recorded will be open sourced and will be made avaialable to download.","recording_license":"","do_not_record":false,"persons":[{"id":1891,"public_name":"Kai Kunze"}],"links":[{"url":"https://www.youtube.com/watch?v=E3VhJhn55a0","title":"Performance Video"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11566.html","id":11566,"guid":"d175d882-b2ec-4dc3-90de-b5429df2607f","logo":null,"date":"2020-12-27T14:00:00+01:00","start":"14:00","duration":"00:40","room":"rc2","slug":"rc3-11566-tracking_ransomware_end-to-end","title":"Tracking Ransomware End-to-end","subtitle":"","track":"IT-Security","type":"lecture","language":"en","abstract":"Ransomware is a type of malware that encrypts the files of infected hosts and demands  payment,  often in a cryptocurrency such as Bitcoin. In this talk, we present a measurement framework that we used to perform a large-scale, two-year, end-to-end measurement of ransomware payments, victims and operators. ","description":"By combining an array of data sources, including ransomware binaries, seed ransom payments, victim telemetry from infections, and a large database of Bitcoin addresses annotated with their owners, we sketch the outlines of this burgeoning ecosystem and associated third-party infrastructure. In particular, we trace the financial transactions, from the moment victims acquire bitcoins, to when ransomware operators cash them out.\r\n\r\nWhile our study focuses on  ransomware, our methods are potentially applicable to other cybercriminal operations that have similarly adopted  Bitcoin as their payment  channel.","recording_license":"","do_not_record":false,"persons":[{"id":12791,"public_name":"Max Aliapoulios"}],"links":[{"url":"http://damonmccoy.com/papers/ransomware_paper.pdf","title":"Tracking Ransomware End-to-end"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11473.html","id":11473,"guid":"2605212d-979a-4bcf-b12f-f8db0f51efcf","logo":null,"date":"2020-12-27T15:00:00+01:00","start":"15:00","duration":"01:00","room":"rc2","slug":"rc3-11473-q_a_with_bruce_schneier","title":"Q\u0026A with Bruce Schneier","subtitle":"A live interview on stage with Bruce – and everybody gets a chance to ask a question.","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"Live Interview with Bruce Schneier. Audience questions can be submitted via chat and have a chance to be asked by the moderator.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":12787,"public_name":"Bruce Schneier"},{"id":1633,"public_name":"frank"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11527.html","id":11527,"guid":"b011ec21-f612-4e9c-a193-8b53ca229cd8","logo":"/system/events/logos/000/011/527/large/hackedmariobrothers.png?1605908195","date":"2020-12-27T18:00:00+01:00","start":"18:00","duration":"00:40","room":"rc2","slug":"rc3-11527-hacking_the_nintendo_game_watch","title":"Hacking the Nintendo Game \u0026 Watch ","subtitle":"Your princess is AES encrypted in another castle","track":"IT-Security","type":"lecture","language":"en","abstract":"On November 13., Nintendo launched its newest retro console, the Nintendo Game and Watch - but by then it was already hacked!\r\n\r\n In contrast to the other Nintendo classic consoles (NES \u0026 SNES), Nintendo upped their game this time: A locked processor, AES-CTR encrypted flash \u0026 co. made it significantly harder to hack it, but in the end it was still hacked - one day before release.\r\n\r\nThis talk walks through the whole process of opening it up, exploiting the firmware up to bringing homebrew to a new console - in a fun, beginner friendly way.","description":"The Nintendo Game \u0026 Watch was anticipated by a lot of retro-interested folks, and the clear expectation was: We wan't to get more games onto this device!\r\n\r\nBut Nintendo made the life of hackers harder: The CPU is locked, the external flash AES encrypted, and the USB-C connector does not have its data-lines connected.\r\n\r\nBut not so fast! In this talk we learn how to exploit the firmware, get code-execution via a NOP-slide, dump the ROMs \u0026 RAMs of the device and achieve what everyone has been asking for: DOOM running on the Nintendo Game \u0026 Watch.\r\n\r\nIf you are interested in the full flow from opening up a device, exploiting it, to writing custom drivers for homebrew, this is your talk! And all you need to follow along are a Game \u0026 Watch and about $4 of equipment!","recording_license":"","do_not_record":false,"persons":[{"id":7775,"public_name":"Thomas Roth"}],"links":[{"url":"https://www.youtube.com/watch?v=Rsi8p5gbaps","title":"Video: Part 1: Hacking the Nintendo Game \u0026 Watch"},{"url":"https://twitter.com/ghidraninja/status/1326855097083686917","title":"Twitter thread on my initial analysis"},{"url":"https://twitter.com/ghidraninja/status/1329191402731868163","title":"Successful homebrew running"},{"url":"https://www.youtube.com/watch?v=sNg_S9UM5ps","title":"DOOM running on the Game \u0026 Watch"},{"url":"https://www.youtube.com/watch?v=-MzmoEFs0bQ","title":"Homebrew on the Game \u0026 Watch"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11436.html","id":11436,"guid":"092d83e0-5377-4aad-86c5-7619c53db897","logo":null,"date":"2020-12-27T19:00:00+01:00","start":"19:00","duration":"00:40","room":"rc2","slug":"rc3-11436-accessible_input_for_readers_coders_and_hackers","title":"Accessible input for readers, coders, and hackers","subtitle":"From eyelid blinks to speech recognition","track":"Hardware \u0026 Making","type":"lecture","language":"en","abstract":"When people develop carpal tunnel or various medical conditions, it can be difficult to use mainstream input mechanisms like keyboards, mice, and phone touchscreens. Ideally, accessible input mechanisms can be added to mainstream computers and phones. I will give two example demos. The first is using voice or eyelid blinks to control an ebook reader on a standard Android phone. The second is using speech recognition to interact with a Linux desktop, even to perform complicated tasks such as programming.","description":"When people develop carpal tunnel or various medical conditions, it can be difficult to use mainstream input mechanisms like keyboards, mice, and phone touchscreens. Such users might have to rely on speech recognition, eye tracking, head gestures, etc. Technology allows devices to understand these mechanisms as user input, and hence provide agency and a communication channel to the rest of the world.\r\n\r\nEvery person's case is a bit different. Sometimes, a fully custom system has to be designed, such as for Stephen Hawking. A team from Intel worked through many prototypes with him, saying: \"The design [hinged] on Stephen. We had to point a laser to study one individual.\" With custom hardware and custom software to detect muscle movements in his cheek, he still could only communicate a handful of words per minute.\r\n\r\nIn less severe situations, the goal is often to add accessible input mechanisms to mainstream computers and phones. Similarly, a blind person will adapt to using a normal smartphone, despite not being able to see the screen. It is not economical to design myriad variants of hardware to handle many different users who all have slightly different needs. Adapting mainstream devices allows a wide range of existing software to be used, from email clients to Google maps, without reinventing everything. \r\n\r\nIn my own case, I have a medical condition and cannot use my hands more than a certain threshold in a day. In order to keep reading books, I designed a speech recognition system and also an eyelid blink system to control an ebook reader app. As a computer programmer, I used to make heavy use of a keyboard to write code. With modern speech recognition, it is possible to design a spoken language that allows precise control over a computer. I will demo an open source voice coding system, and describe how it can be adapted to do any task on a desktop computer.","recording_license":"","do_not_record":false,"persons":[{"id":12752,"public_name":"David Williams-King"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11582.html","id":11582,"guid":"6c74ea99-af50-4464-954f-b4fb025230f4","logo":null,"date":"2020-12-27T20:00:00+01:00","start":"20:00","duration":"01:00","room":"rc2","slug":"rc3-11582-cory_doctorow_fireside_chat","title":"Cory Doctorow – Fireside Chat","subtitle":"Reading and Q\u0026A","track":"Fireside Chat","type":"performance","language":"en","abstract":"Fireside Chat with Cory Doctorow. Make sure not to miss Cory's main talk \"What the cyberoptimists got wrong - and what to do about it\" one hour earlier, day 19:00h in rc1.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":3266,"public_name":"doctorow"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11581.html","id":11581,"guid":"0a3c687b-f62d-42f7-98b2-3b1163b9a73e","logo":"/system/events/logos/000/011/581/large/Die_Unvollkommenen_Cover.jpg?1608586549","date":"2020-12-27T21:20:00+01:00","start":"21:20","duration":"01:00","room":"rc2","slug":"rc3-11581-theresa_hannig_fireside_chat","title":"Theresa Hannig – Fireside Chat","subtitle":"Lesung und Hintergrundgespräch","track":"Fireside Chat","type":"performance","language":"de","abstract":"Lesung aus \"Die Unvollkommenen\", Vorstellung des aktuellen Buchprojekts \"PANTOPIA\" und lockere Q\u0026A mit der deutschen SciFi-Bestsellerautorin.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":7446,"public_name":"Theresa Hannig"}],"links":[],"attachments":[]}],"chaosstudio-hamburg":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11541.html","id":11541,"guid":"09b009df-ab6e-41e3-a921-6182dd54f758","logo":null,"date":"2020-12-27T14:00:00+01:00","start":"14:00","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11541-bulgaria_protests_2020","title":"Bulgaria Protests 2020","subtitle":"Do you see us?","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"2020 was and still is an eventful year - pandemic, protests, orange men, you name it. This talk is a comprehensive overview about yet another tumult: the protests that occured in Bulgaria in 2020, months of demonstrations against an European Union member state government that were largely unacknowledged in the rest of the EU - from the perspective of an expat and an involved small scale activist on the fringe.","description":"The goal is to convey to some extent my experience and acquired updated knowledge I made while trying to figure out what exactly was going on as the protests erupted in my home country, who were the actors, what do they want, what interests do they represent and what is the current state. This will include a brief historical background, introduction to the main political and criminal actors, societal factors, the story of how a national flag on a beach in Rossenez started it all, how the protests developed, how the national \u0026 international press reacted and finally the EU's position or the lack of such. To top it off we will see/hear some first hand impressions of a protester on the ground.\r\n\r\nIn slightly more detail, the talk will consist of:\r\n1. A brief introduction:\r\n- a brief historical perspective and context up to 2020, \r\n- the ups \u0026 downs that formed the poorest country in the EU, \r\n- its evergoing struggle with corruption and crime deeply interwined in the state itself. \r\n2. An outline of the current landscape as shown with\r\n- some statistics backed up by official data,\r\n- current state of education, health, economics sectors\r\n- the current ruling party GERB and Bulgarian sun king Boyko Borrissov\r\n- other present and past key political players.\r\n3. A summary and a timeline of the protests,\r\n- why and how they began\r\n- an overview of the highlights, such as police brutality, press (non)freedom, state suppression etc.,\r\n- why are the people protesting,\r\n- what protesting fractions were there, (by no means the full picture) and what they seek\r\n4. Appearances of and reactions to the protests,\r\n- digital means of these protests (Facebook, Twitter)\r\n- some problems with the protests (racism, sexism),\r\n- a brief live impression from an on-the-ground protester.\r\n5. Role of the EU, its institutions and MEPs, its silence/involvement,\r\n- EPP, its chairman \u0026 MEPs shielding the corruption\r\n- EU politicians showing solidarity and drawing attention to the problem,\r\n- the current outcome.","recording_license":"","do_not_record":false,"persons":[{"id":12189,"public_name":"m"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11345.html","id":11345,"guid":"d10082b8-313b-4741-bf19-daaf02406e95","logo":null,"date":"2020-12-27T15:00:00+01:00","start":"15:00","duration":"01:00","room":"chaosstudio-hamburg","slug":"rc3-11345-neoliberalism_has_been_killing_us_-_chile_is_awakening","title":"Neoliberalism has been killing us - Chile is awakening","subtitle":"The Chilean peoples´struggle for dignity and social equality","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"Since October 2019 the Chilean people have been fighting for social dignity and equality. During the dictatorship of Augusto Pinochet in the 80's nearly everything in Chile was privatized including the health system, education and pensions. As a consequence the people suffer economically, get deeply indebted and become slaves of the banks. The Chilean people are fighting for and demanding a new constitution which is free of neoliberalism.","description":"As an eyewitness to the historic events in Santiago of the Chilean uprising beginning in 2019, I participated in many demonstrations, took hundreds of photographs, interviewed many demonstrators and got hit by a lof of teargas. I saw at first hand the violence of the Carabiñeros de Chile, the highly militarized police that  President Piñera sent out to attack his own citizens. I saw seriously wounded people in the streets as well as the brave and heroic people who helped them. In my presentation I will show fotos of the movement as well as the fanatstic street art which tells the story of the Chilean revolution.","recording_license":"","do_not_record":false,"persons":[{"id":12137,"public_name":"Sabine Mehlem"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11493.html","id":11493,"guid":"94be0187-e7fd-4629-85e7-433ca1528ea7","logo":null,"date":"2020-12-27T16:20:00+01:00","start":"16:20","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11493-berg-karabach_zwischen_krieg_und_frieden","title":"Berg-Karabach zwischen Krieg und Frieden","subtitle":"Der Konflikt zwischen Armenien und Aserbaidschan im Südkaukasus","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Im Zuge des diesjährigen rC3 Events soll der Konflikt um die Region Berg-Karabach in diesem Vortrag aufgearbeitet werden. Der seit 26 Jahren andauernder Konflikt entwickelte sich im September diesen Jahres in einen zwischenstaatlichen Krieg zwischen Armenien und Aserbaidschan, der drastische Schäden verursachte. Es befinden sich über 75.000 Menschen aus den Kriegsgebieten auf der Flucht, ohne Heimat und ohne Eigentum, und eine humanitäre Katastrophe wird mit jedem Tag wahrscheinlicher. Woran es dem Konflikt fehlt ist klar: Transparenz und Sichtbarkeit. Der Vortrag ist in drei Hauptteile gegliedert. Im ersten Schritt werden die involvierten Akteure und ihre Positionen analysiert. Danach sollen technische Entwicklungen Armeniens und Aserbaidschans sowie der Kriegsverlauf evaluiert werden, um in einem dritten Teil realistische Lösungsansätze zu betrachten, die auf eine langfristige Deeskalation des Konfliktes abzielen. Die übergeordnete Frage lautet, welchen Einfluss der Konflikt um Berg-Karabach auf die internationale Ordnung hat.","description":"Berg-Karabach zwischen Krieg und Frieden\r\nDer Konflikt zwischen Armenien und Aserbaidschan im Südkaukasus\r\n\r\nvon Larissa Willamowski\r\n\r\nAm 27. September 2020 eskalierten Kampfhandlungen armenischer und aserbaidschanischer Truppen in Südkaukasus innerhalb weniger Tage zu einem zwischenstaatlichen Krieg (Stöber 2020). Dieser Ausbruch kommt erschreckend, wenn auch nicht überraschend, zumal sich die Beziehungen beider Staaten in den letzten Jahren zunehmend verschlechtert haben (Gasparyan 2019). Sechs Wochen hielten die blutigen Auseinandersetzungen an, bis in der Nacht vom 9. auf den 10. November unter der Vermittlung des russischen Präsidenten Vladimir Putin bei einem zweiten Versuch ein neuer und, bis heute, weitestgehend eingehaltener Waffenstillstand ausgehandelt werden konnte (Stöber 2020). Im Zuge des diesjährigen rC3 möchte ich den wiederaufgeflammten Konflikt um die Region Berg-Karabach in einem Vortrag aufarbeiten. Ich argumentiere, dass mehr Sichtbarkeit und Transparenz für diesen Konflikt geschaffen werden muss, was sich erstens durch die Involvierung von Regionalmächten, wie der Türkei, und Großmächten, allem voran Russlands, begründet (Abushov 2019). Auch die Rolle des Westens soll beleuchtet werden, denn daraus folgt, dass dieser regionale Konflikt eben doch auf die internationale Ebene rückwirkt. Zweitens ist die Erhältlichkeit von Informationen vor Ort sehr eingeschränkt. Deshalb wird durch den Vortrag versucht, durch journalistische Beiträge einen Mehrwert für die Informationsbeschaffung zu leisten. Das soll der Vermischung der Narrativen der Akteure entgegenwirken. Drittens beschuldigen sich die Konfliktparteien des Bruchs des humanitären Völkerrechts durch den Beschuss ziviler Ziele. Das Schweigen der internationalen Gemeinschaft zu diesen Vorwürfen ist zu laut, um nicht auf diesen Punkt aufmerksam zu machen. Viertens stellt sich nach einer, aus armenischer Sicht, zerschmetternden Niederlage Armeniens die Frage, wie es nach dem Krieg weitergehen soll. Was passiert mit den mehr als 75.000 Menschen vor Ort, die aufgrund des Krieges ihre Heimat verloren haben und sich auf der Flucht befinden? Realistische Lösungsansätze die auf eine Vermeidung einer Re-eskalation des Konflikts abzielen und die die katastrophalen Umstände vor Ort in den Vordergrund rücken, müssen öffentlich diskutiert werden.\r\n\r\nUrsprünge des Konfliktes: \r\nDer Bruch der UdSSR führte zu gravierenden Strukturänderungen im internationalen System, dessen Folgen der Region des Südkaukasus bis heute nicht erspart bleiben. 1991 eskalierten bewaffnete Auseinandersetzungen zwischen Armenien und Aserbaidschan in einem dreijährigen Krieg. Konfliktgegenstand ist damals so wie heute die Region um Berg-Karabach. \r\nRussland schaffte es in seiner Rolle als OSCE Mediator die Konfliktparteien im Mai 1994 zu einem Waffenstillstandsabkommen zu bewegen (Abushov 2019). Dieses Abkommen stellt einen wichtigen Moment dar, denn seit jeher konnte selbst nach 26 Jahren intensiver Friedensverhandlungen unter der Aufsicht der Troika Gruppe (RU, FR, USA) nicht mehr garantiert werden, als die bloße Weiterführung eines Waffenstillstandes. Basierend auf dem fortwährenden „no war – no peace“ Status warnen Forscher*innen seit Jahren vor einem erneuten Aufflammen eines bewaffneten Konfliktes (Özkan 2008). Diese instabile Grundlage ist einer der vielen Gründe, weshalb zunächst im Juli und später im September 2020 bewaffnete Gefechte wiederaufflammten. Die Gegenstände des Konfliktes sind nach wie vor territoriale und ethnische Streitigkeiten um Berg-Karabach und angrenzende Gebiete (Stöber 2020). \r\n\r\nAufbau des Vortrags:\r\n1.\tAkteurs Identifizierung: Who is fighting whom?\r\nUm zu verstehen wieso der Konflikt erneut in einem Krieg endete, werden zunächst die Positionen der Hauptakteure analysiert. Im Mittelpunkt stehen dabei die Rivalität zwischen Aserbaidschan und Armenien und die Position Berg-Karabachs als de-facto Staat ohne internationale Anerkennung. In einem zweiten Schritt stelle ich mir die Frage, welche Rolle und Interessen internationale Akteure wie Russland, die Türkei und der Westen im Konflikt verfolgen. Auch internationale Organisationen wie die OSZE und die Minsk Gruppe spielen in diesem Zusammenhang eine wichtige Rolle. \r\n2.\tTechnische Entwicklungen und Kriegsverlauf\r\nIn diesem Teil wird diskutiert, wie (technischen) Kapazitäten der Kriegsparteien den Verlauf des Konfliktes beeinflusst haben. Zunächst werden die Kapazitäten beider Staaten gegenübergestellt. Außerdem evaluiere ich den Zusammenhang der jeweiligen Verteidigungsbudgets der Staaten und der wirtschaftlichen Performance der Staaten. In einem zweiten Schritt kann bei einem genauen Blick auf den Kriegsverlauf gezeigt werden, welche Technologien entscheidende Auswirkungen auf den Kriegsverlauf hatten. \r\nArmenien und Aserbaidschan beschuldigen sich gegenseitig des Bruchs humanitären Völkerrechts durch den Beschuss ziviler Ziele. Durch die vorangegangene Analyse soll geklärt werden, inwiefern die Vorwürfe bestätigt werden können. \r\n3.\tNeue Friedensverhandlungen\r\nWenn Armenien und Aserbaidschan bis heute unter internationaler Vermittlung nicht in der Lage waren das Waffenstillstandsabkommen auf ein längerfristiges Friedensabkommen auszuweiten, wie hoch ist dann heute die Wahrscheinlichkeit, dass dieses Ziel umgesetzt wird? Dieser Teil bettet die analysierten Positionen und Narrativen der Kriegsparteien in den Kontext der internationalen Friedensvermittlungen. Ist ein Friedensabkommen dieses Mal wahrscheinlicher als vor 16 Jahren? Welche Aspekte soll ein zufriedenstellendes Abkommen beinhalten?\r\n\r\nLiteraturverzeichnis:\r\nAbushov, Kavus (2019). Russian foreign policy towards the Nagorno-Karabakh conflict: \r\nprudent geopolitics, incapacity or identity?, East European Studies, 35(1),72-92.\r\nStöber, Sylvia (2020). Ein historischer Tag im Südkaukasus, Tagesschau, Link: \r\nhttps://www.tagesschau.de/ausland/armenien-aserbaidschan-bergkarabach-101.html (aufgerufen am 19.11.20)\r\nÖzkan, Behlül (2008). Who gains from the „No War No Peace“ Situation? A critical analysis of \r\nthe Nagorno-Karabakh conflict, Geopolitics, 13(3), 572-599.\r\nGasparyan (2019). Understanding the Nagorno-Karabakh conflict: domestic politics and \r\ntwenty-five years of fruitless negotiations 1994-2018, Caucasus Survey, 7(3), 235-250.\r\n\r\n\r\n","recording_license":"","do_not_record":false,"persons":[{"id":12811,"public_name":"Larissa"}],"links":[],"attachments":[{"url":"/system/event_attachments/attachments/000/004/197/original/Konzeptpapier_-_Berg-Karabach_zwischen_Krieg_und_Frieden_von_Larissa_Willamowski.pdf?1605896860","title":"Konzeptpapier Larissa Willamowski Berg-Karabach"}]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11392.html","id":11392,"guid":"b66dacb2-b811-4520-a45a-013c083d172e","logo":null,"date":"2020-12-27T17:10:00+01:00","start":"17:10","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11392-the_weakest_link","title":"The Weakest Link","subtitle":"Wie man mit einem langweiligen Newsletter einen Google oder Microsoft Account übernimmt","track":"IT-Security","type":"lecture","language":"de","abstract":"Ein Klick auf einen \"Unsubscribe\"-Link in einem Newsletter reicht oft aus, damit ein Angreifer eine Rufumleitung bei einer Zielperson einrichten kann. Damit lassen sich etwa die Passwörter von mit der Rufnummer verknüpften Google- oder Microsoft-Accounts zurücksetzen.","description":"Mobilfunkbetreiber sind weiterhin in vielen Fällen das schwächste Glied einer Sicherheitskette. Dieser Vortrag behandelt mehrere Cross Site Request Forgery (CSRF) Schwachstellen in Webapplikationen von Mobilfunkanbietern, die es ermöglichen, Rufumleitungen einzurichten. In Österreich waren im Jahr 2020 etwa 40% der Nutzer*innen von derartigen Schwachstellen betroffen.","recording_license":"","do_not_record":false,"persons":[{"id":12603,"public_name":"Florian Schweitzer"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11450.html","id":11450,"guid":"8622c2fd-f114-4744-b1b4-957b39e95fbc","logo":"/system/events/logos/000/011/450/large/Tutanota-logo.jpg?1605864293","date":"2020-12-27T18:00:00+01:00","start":"18:00","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11450-pq_mail_enabling_post_quantum_secure_encryption_for_email_communication","title":"PQ Mail: Enabling post quantum secure encryption for email communication","subtitle":"","track":"IT-Security","type":"lightning_talk","language":"en","abstract":"The Internet as we know it depends on encryption: confidential communication, financial transactions, critical infrastructure - all of these are at risk if encryption can be broken. Today all sorts of players heavily invest in developing quantum computers. These computers promise to bring great advantages and speeds to information technology. But they are also developed to become unprecedented surveillance machines. The race is on between quantum computers and quantum-resistant cryptography.\r\nIn the talk we present our approach how to achieve post-quantum security as well as forward and future secrecy by implementing a pre- and post-quantum secure communication protocol based on the Signal protocol.","description":"Email communication - even when encrypted - is saved on a huge scale (e.g. by the NSA) and can be decrypted once there is a large-scale universal quantum computer. That's why we need to take action now and enable everyone to easily encrypt sensitive emails with post quantum secure algorithms.\r\n\r\nTogether with the L3S of Leibniz University Hanover, we at Tutanota have started a research project to achieve just that: PQ Mail.\r\n\r\nThis project aims at implementing a hybrid encryption protocol based on the Signal protocol in Tutanota, combining the algorithms currently used in Signal (ECDH and XEdDSA) with quantum-safe encryption schemes. With this we plan not only to achieve post-quantum end-to-end encryption, but also future and forward secrecy.\r\n\r\nIn this talk we will present our approach and address the obstacles we are facing when implementing it, such as:\r\n\r\n* Keeping the security properties of the Signal protocol without a suitable post quantum Diffie-Hellman equivalent\r\n\r\n* Satisfying expectations for email usage while using a stateful protocol\r\n\r\n* Making sure the encryption and decryption of emails can be achieved fast, even on mobile devices.","recording_license":"","do_not_record":false,"persons":[{"id":12773,"public_name":"Vitor Sakaguti"},{"id":12774,"public_name":"Sara"},{"id":12803,"public_name":"A.L. Fehlhaber"}],"links":[{"url":"https://tutanota.com/blog/posts/pqmail-launch-post-quantum-cryptography/","title":"L3S of Leibniz University and Tutanota launch research project to secure emails against quantum computer attacks."},{"url":"https://main.sec.uni-hannover.de/projects/pq-mail/","title":"TeamUSEC PQmail"}],"attachments":[]}],"restrealitaet":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11564.html","id":11564,"guid":"8419ab45-b863-44fa-9628-b62a008b4e64","logo":null,"date":"2020-12-27T12:00:00+01:00","start":"12:00","duration":"01:00","room":"restrealitaet","slug":"rc3-11564-restreale_technikgeschichte_n","title":"Restreale Technikgeschichte(n)","subtitle":"","track":"Community","type":"lecture","language":"de","abstract":"Seit 2003 gibt es die Berliner Online-Community \"Restrealitaet\". So vielfältig die User*innen des Forums sind, so speziell ist auch die zugrundeliegende Software. Nichts von der Stange, sondern liebevoll von Hand entworfen und entwickelt, über die Jahre immer wieder verbessert, verändert und neu erfunden ist sie das technische Rückgrat dieses Gesamtkunstwerkes.\r\n\r\nDer Vortrag möchte, gespickt mit Anekdoten, die Entwicklung der Restrealitaet aus technischer Sicht darstellen.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":13594,"public_name":"senpf"},{"id":9898,"public_name":"RR-Rufus"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11586.html","id":11586,"guid":"5c66d45f-c515-42f5-b530-f8a8a4091321","logo":null,"date":"2020-12-27T14:00:00+01:00","start":"14:00","duration":"00:40","room":"restrealitaet","slug":"rc3-11586-die_wunderliche_welt_der_netzteilhieroglyphen","title":"Die wunderliche Welt der Netzteilhieroglyphen","subtitle":"Was die ganzen Labels, Logos und Emojis auf einem Gerät bedeuten. - und wofür man mitbezahlt","track":"Hardware \u0026 Making","type":"lecture","language":"de","abstract":"Ob Notebook oder Bluetooth-Lautsprecher: wenn Ihr ein neues Elektrogerät auspackt, ist da meist auch ein Netzteil beigelegt. Habt Ihr Euch auch schon mal gefragt, was diese dutzenden Symbole, die alle auf der Rückseite eng an eng aneinandergedruckt sind, eigentlich alle bedeuten? Klar, zwei oder drei der Symbole kennt eigentlich jeder von uns. Aber die anderen? Sind die für uns relevant? Bescheinigen die uns, das wir ein tolleres Produkt erhalten haben? Oder verpflichten uns diese Symbole gar zu etwas, was wir gar nicht so genau wissen...? ","description":"","recording_license":"","do_not_record":false,"persons":[{"id":13635,"public_name":"Anoush Dehghani"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11498.html","id":11498,"guid":"d77fc397-6f17-4bd0-8478-29505493df14","logo":"/system/events/logos/000/011/498/large/echsistenzialism%283%29.png?1608037009","date":"2020-12-27T18:00:00+01:00","start":"18:00","duration":"02:00","room":"restrealitaet","slug":"rc3-11498-schwurbeldemos_der_neuen_rechten_und_gegenprotest","title":"Schwurbeldemos der Neuen Rechten und Gegenprotest","subtitle":"Aufruf zur reptiloiden Weltrevolution","track":"Ethics, Society \u0026 Politics","type":"other","language":"de","abstract":"Aktivist*innen der Antiverschwurbelte Aktion nehmen den kleinen \"Volksaufstand\" mit Humor. Seit sich die sogenannten Hygiene-Demo auf dem Rosa-Luxemburg-Platz bildete, gehen sie energisch dagegen vor. Es geht um die große Gefahr rechter Anschlussfähigkeit und Theoretischen und praktische Gegenstrategien. \r\n","description":"\u003col\u003e\r\n\u003cli\u003ebegrüßung \u0026 schwurbelhack2021\u003c/li\u003e\r\n\u003cli\u003eprojekt erde\u003c/li\u003e\r\n\u003cli\u003esong\u003c/li\u003e\r\n\u003cli\u003emaskeninfo DPG \u003c/li\u003e       \r\n\u003cli\u003eloge der echsenmenschen\u003c/li\u003e\r\n\u003cli\u003eschwurbelgramm\u003c/li\u003e\r\n\u003cli\u003esong \u003c/li\u003e\r\n\u003cli\u003eantischwurbler (noch offenes thema)\u003c/li\u003e        \r\n\u003cli\u003esong\u003c/li\u003e\r\n\u003cli\u003ewas es mit mir macht\u003c/li\u003e\r\n\u003cli\u003erechtfertigungs-techst\u003c/li\u003e\r\n\u003cli\u003esong\u003c/li\u003e\r\n\u003cli\u003eintersechsionale bündniss\u003c/li\u003e\r\n\u003cli\u003esong\u003c/li\u003e            \r\n\u003c/ul\u003e","recording_license":"","do_not_record":false,"persons":[{"id":13604,"public_name":"antiverschwurbelte aktion"}],"links":[{"url":"https://t.me/rlpaktion","title":"@rlpaktion auf tg"},{"url":"https://mastodon.social/@reclaimrosalux1","title":"mastadon"},{"url":"https://twitter.com/reclaimrosalux1","title":"twitter"},{"url":"www.echsit.xyz","title":"Webseite"}],"attachments":[{"url":"/system/event_attachments/attachments/000/004/221/original/echsit-version6.pdf?1608034005","title":"flyer aufstiegsprogramm echsit"}]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11496.html","id":11496,"guid":"c17fa029-c5e4-4ba0-93c1-32e9dc6ff6e7","logo":null,"date":"2020-12-27T20:00:00+01:00","start":"20:00","duration":"00:40","room":"restrealitaet","slug":"rc3-11496-1up_analoge_rebellion_2_0","title":"1UP – Analoge Rebellion 2.0","subtitle":"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Die Berliner 1UP Crew hat  den Spagat zwischen analoger Rebellion und digitaler Inklusion im Bereich Graffiti geschafft. Einige Vertreter*innen diskutieren mit uns über ihre Facetten der Graffitikultur","description":"","recording_license":"","do_not_record":false,"persons":[{"id":13629,"public_name":"1UP Crew"}],"links":[],"attachments":[]}]}},{"index":2,"date":"2020-12-28","day_start":"2020-12-28T09:00:00+01:00","day_end":"2020-12-29T04:00:00+01:00","rooms":{"rc1":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11430.html","id":11430,"guid":"e1cdee23-68c8-4d73-b02f-d9a64fa92d97","logo":null,"date":"2020-12-28T12:20:00+01:00","start":"12:20","duration":"01:00","room":"rc1","slug":"rc3-11430-scientific_literacy_101","title":"Scientific Literacy 101","subtitle":"Let's understand how the scientific system works","track":"Science","type":"lecture","language":"en","abstract":"This year saw a major invasion of scientific work into the center of public attention. Scientific results came hot of the press and into the news cycles. For many people, this sudden impact of scientific language, culture and drawing of conclusion clashed with their every day world view. In my talk, I want to prepare the audience for the next wave of scientific influx and help them to get a systemic understanding of academia. How do scientists work? What are the funding and career structures? How do we do science? And, most importantly, how do we do science better?\r\n","description":"When we talk about scientific results, we assume most of the time that everybody knows how the scientific system produced them. This assumption can be problematic. The communication of risk and uncertainty, for example, varies greatly between the scientific community and society. A misunderstanding of science, scientific language or scientific publishing can lead to very wrong ideas about how things work. \r\nIn this talk, I want to give a beginner friendly crash course on the scientific system. How does one get into science? Who pays for everything? What is scientific uncertainty? How does a scientific paper work? How can we address issues like bias and lack of diversity in science?\r\n\r\nI am an eager science communicator, who worked in the past in in molecular biology research and has since left active research to communicate science to the public. My goal is to share my view on the inner workings of science with more people to help them to become more science literate – and ultimately to be able to critically assess communication from researchers, institutions and PR companies. At the end of my talk, I want the audience to have a better understanding not only about the results of research but also the research process. We can only understand and interpret scientific results if we understand how they came to be. ","recording_license":"","do_not_record":false,"persons":[{"id":9808,"public_name":"derJoram"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11371.html","id":11371,"guid":"56341a5c-6d90-49af-8930-46250e200fe0","logo":"/system/events/logos/000/011/371/large/Volker-Quaschning_BPK1-square.jpg?1606805431","date":"2020-12-28T13:40:00+01:00","start":"13:40","duration":"01:00","room":"rc1","slug":"rc3-11371-nach_der_coronakrise_ist_mitten_in_der_klimakrise","title":"Nach der Coronakrise ist mitten in der Klimakrise","subtitle":"Wege aus der Klimakrise - Was uns droht und was getan werden müsste","track":"Science","type":"lecture","language":"de","abstract":"Immer neue Hitzerekorde, Dürresommer und Naturkatastrophen führen uns immer drastischer vor Augen, dass ein ungebremster Klimawandel dramatische Auswirkungen für die Menschheit haben wird.","description":"Der Weltklimarat empfiehlt dringend, die globale Erwärmung nicht über 1,5°C steigen zu lassen. Wollen wir das erreichen, müssen wir bereits bis 2040 eine Energieversorgung realisieren, die völlig ohne Erdgas, Erdöl und Kohle auskommt. Mit der aktuellen deutschen Energie- und Klimaschutzpolitik ist ein Einhalten des Pariser Klimaschutzabkommens unmöglich. Dieser Vortrag zeigt, mit welchen Konsequenzen wir beim Verfehlen der Klimaziele rechnen müssen und wie wir diese jetzt noch vermeiden können.","recording_license":"","do_not_record":false,"persons":[{"id":12454,"public_name":"Volker Quaschning"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11357.html","id":11357,"guid":"a8b8ec8d-5065-401f-8bbf-6d84b5ec50f7","logo":null,"date":"2020-12-28T15:00:00+01:00","start":"15:00","duration":"01:00","room":"rc1","slug":"rc3-11357-angry_weather","title":"Angry weather ?","subtitle":"How human-induced climate change affects weather  (\u0026 how we know)","track":"Science","type":"lecture","language":"en","abstract":"\"Listen to the science\" is relatively easy when it comes to mitigating climate change, we need to stop burning fossil fuels. However, climate change is already here, in this talk I'll focus on what the science has to say on extreme weather and losses  and damages.","description":"For a long time it has not been possible to make the  - arguably for the day to day life of most people crucial link – from anthropogenic climate change and global warming to individual weather and climate-related events with confidence but this has changed in recent years. Quantifying and establishing the link between individual weather events, that often lead to large damages, has been the focus of the emerging science of extreme event attribution. Even if a comprehensive inventory of the impacts of climate change today is impossible, event attribution allows us to understand better what climate change means.\r\n\r\nArguably even more importantly, disentangling predictable drivers of an extreme event like anthropogenic climate change, from natural variability and changes in vulnerability and exposure will allow a better understanding of where risks are coming from and in turn how they can be addressed. Extreme events open a window to address the problem of exposure and vulnerability. Scientific evidence of the importance of different drivers is essential to avoid playing blame games and allows instead for a well-informed debate about addressing risk.","recording_license":"","do_not_record":false,"persons":[{"id":12196,"public_name":"Friederike Otto"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11577.html","id":11577,"guid":"bdf8e1ad-c200-46ad-8b91-1c58083952a7","logo":null,"date":"2020-12-28T18:00:00+01:00","start":"18:00","duration":"01:00","room":"rc1","slug":"rc3-11577-from_cold_war_to_crypto_war_and_back_again","title":"From Cold War to Crypto War and Back Again?","subtitle":"","track":"IT-Security","type":"lecture","language":"en","abstract":"A Brief History of Cryptography and governments' self-damaging fight against it.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":9677,"public_name":"Ross Anderson"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11533.html","id":11533,"guid":"5e4bba12-b53d-4a24-9193-9c9c760757ed","logo":null,"date":"2020-12-28T19:20:00+01:00","start":"19:20","duration":"00:40","room":"rc1","slug":"rc3-11533-crypto_wars_2_0_de","title":"Crypto Wars 2.0 (de)","subtitle":"","track":"IT-Security","type":"lecture","language":"de","abstract":"Die globale Informationsoperation der 5-Eyes-Allianz \u0026 Verbündeter mit FBI, Europol et. al., sowie den nationalen Innen- und Justizministerien gegen E2E-Verschlüsselung. Die Entwicklung dieser Operation zur Durchsetzung gemeinsamer Interessen von 2015 bis zur Resolution des EU-Ministerrats im Dezember 2020.","description":"Die Resolution des EU-Ministerrats zum \"Verschlüsselungsproblem\" ist das Ergebnis einer konzertierten Kampagne der Spionageallianz Five Eyes mit FBI, Europol \u0026 vielen weiteren Polizeibehörden gegen E2E-Verschlüsselung. 2015 machten sich die Geheimdienste in drei Kontinenten plötzlich große Sorgen um die Überwachungsmöglichkeiten für die Strafverfolger. Die Folge war eine Serie von weltweiten Einzelkampagnen, die abwechselnd von Europol und FBI bzw. den Diensten der „Five Eyes“-Spionageallianz samt NATO-Staaten und den zuständigen Ministern in der Öffentlichkeit gefahren wurden. Jeder bedeutende Move dieser Kampagne folgte zeitversetzt den Terroranschlägen salafistischer Klerikalfaschisten irgendwo in der sogenannten \"westlichen Welt\".. \r\n\r\nAm Anfang standen Nachschlüssel für iPhones von Terroristen, dann kam Geraune über \"Going Dark\" von FBI \u0026 Europol. In Folge wurden \"Goldene Schlüssel\" gefordert, \"Hilfe, die Polizei wird blind\" geschrien, dann wurde die ETSI-Überwachungsschnittstelle für Facebook-Messenger, WhatsApp \u0026 Co standardisiert, Europol und FBI verlangten plötzlich keine Schlüssel mehr, sondern \"Vordertüren\". 2018 kamen dann die moderaten Vorschläge des GCHQ an die Betreiber von E2E-Plattformen aufs Tapet, doch bittschön einen ADK (Additional Decryption Key) zur E2E hinzuzufügen, auf dass den Strafverfolgern geholfen werde.       \r\n\r\nUnd genau diese \"Lösung\" wird jetzt angestrebt um der drohenden Datenarmut von Cops \u0026 Spooks zu begegnen. Deren Goldenes Zeitalter der Überwachung wird nämlich mit dem Ende des Seuchenjahrs 2020 eingeleitet.","recording_license":"","do_not_record":false,"persons":[{"id":5097,"public_name":"Erich Moechel"}],"links":[],"attachments":[]}],"rc2":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11358.html","id":11358,"guid":"94ead6ee-f201-410c-b777-e2f77dd9d014","logo":"/system/events/logos/000/011/358/large/iphone.png?1605059250","date":"2020-12-28T13:40:00+01:00","start":"13:40","duration":"01:00","room":"rc2","slug":"rc3-11358-fuzzing_the_phone_in_the_iphone","title":"Fuzzing the phone in the iPhone","subtitle":"D-d-d-di-di-d-d-di-d-di-d-di-d-dimm!","track":"IT-Security","type":"lecture","language":"en","abstract":"How secure is the interface between baseband chips and iOS?\r\nWhile this interface should protect against escalations from the baseband into operating system components, its implementation is\r\nfull of bugs. Fuzzing this interface is not only relevant to security, but also results in various funny effects, since the iPhone looses\r\ninformation about its identity and location, and eventually ends up in a state with a few thousand unread SMS that can no longer be deleted.","description":"The baseband chip is the phone within a smartphone. While users might disable Bluetooth or not join untrusted Wi-Fis to increase security, mobile data and phone calls are always on. Some baseband features remain enabled even without an active data pass or SIM card installed.\r\nThus, baseband chips are a popular target for Remote Code Execution (RCE) attacks. Launched over-the-air, they do not leave any trace on intermediate servers.\r\n\r\nWith recently published tools, emulating and fuzzing baseband firmware has become accessible and gained a lot of attention by security researchers.\r\nYet, a critical part of an exploit chain remains escalating from the baseband chip into the operating system. An attacker with code execution in the baseband chip could modify network traffic and escalate with a Web browser exploit. However, wireless communication is already susceptible to manipulation without a baseband exploit due to missing user data integrity protection, as shown by the IMP4GT attacks on LTE.\r\nMoreover, network traffic manipulation still requires the attacker to wait until their target creates traffic in the context of a Web browser.\r\n\r\nMore stealthy attacks can be achieved via baseband activity that does not require any user interaction, such as retrieving information about nearby base stations. On an iPhone, the interface forwarding this information comes in two variants for Intel and Qualcomm baseband chips. Both interfaces interact with CommCenter, which is the phone component of the iPhone that parses and forwards phone calls, SMS, and more.\r\n\r\nThis talk demonstrates how to fuzz these interfaces as well as various challenges and solutions in fuzzing these. The baseband interface is such an integral part of iOS that fuzzing results are not limited to finding issues within CommCenter but also led to discovery of bugs in various daemons connecting to it. Some of these issues might also be triggered by a rouge base station, though, fuzzing the baseband interface locally results in higher performance and more control. \r\n\r\nFuzzing the baseband interface demonstrates fuzzing in a way that is easy to understand even for those who are not familiar with security research. The iPhone under test receives SMS so fast that it will not finish playingthe \u003ci\u003eDimm\u003c/i\u003e notification sound before the next SMS arrives, and, thus,\r\nthis actually sounds like \u003ci\u003eD-d-d-di-di-d-d-di-d-di-d-di-d-dimm!\u003c/i\u003e The sound effect when the audio controller hangs up is also quite fun. Exposure notifications are no longer available due to the location change, since the iPhone uses baseband information to determine its region. And due to all the confusion about its identity, it regularly asks for activation.\r\n\r\nBesides security analysis, understanding the baseband interface means that it can also be controlled on jailbroken iPhones. Moreover, passive observations are possible on non-jailbroken devices with a baseband debug profile. This opens up these devices for new wireless research opportunities.","recording_license":"","do_not_record":false,"persons":[{"id":4927,"public_name":"jiska"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11397.html","id":11397,"guid":"b6d707df-9f91-44d4-a53d-34a81f33dcd8","logo":null,"date":"2020-12-28T15:00:00+01:00","start":"15:00","duration":"01:00","room":"rc2","slug":"rc3-11397-advanced_hexagon_diag","title":"Advanced Hexagon Diag","subtitle":"Harnessing diagnostics for baseband vulnerability research","track":"IT-Security","type":"lecture","language":"en","abstract":"State-of-the-art report on Qualcomm DIAG diagnostic protocol research, its modern implementation as it appears in Hexagon basebands, advanced harnessing and reverse-engineering on modern off-the-shelf smartphones.","description":"Diag is a proprietary diagnostics and control protocol implemented in omnipresent Qualcomm Hexagon-based cellular modems, such as those built-in Snapdragon SoCs, and named so after the DIAG task in the baseband's RTOS that handles it. Diag presents an interesting non-OTA attack surface via a locally exposed interface channels to both the application processor OS and the USB endpoints, and advanced capabilities for controlling the baseband. \r\n\r\nSince Diag was first reverse-engineered around 2010, a lot has changed: mobile basebands are becoming increasingly security-hardened and production-fused, Hexagon architecture is gaining some serious advantages in the competition, and the Diag protocol itself was changed and locked down. Meanwhile, local attack surface in basebands is gaining importance, and so does baseband security and vulnerability research. \r\n\r\nIn this talk I will present the state-of-the-art on Diag research, based on previously unpublished details about the inner workings of the Diag infrastracture that I reverse-engineered and harnessed for my research purposes, its modern use, and how we can exploit it to talk to the production-fused baseband chip on off-the-shelf modern phones such as Google Pixel, while understanding what exactly we are doing.","recording_license":"","do_not_record":false,"persons":[{"id":12610,"public_name":"Alisa Esage"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11453.html","id":11453,"guid":"03c67cc6-92e9-4f3c-9815-5d799b9a7f00","logo":null,"date":"2020-12-28T18:00:00+01:00","start":"18:00","duration":"01:00","room":"rc2","slug":"rc3-11453-der_netzpolitische_wetterbericht_2020","title":"Der netzpolitische Wetterbericht 2020: ","subtitle":"\"Wir kommen um uns zu beschweren\"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Der netzpolitische Wetterbericht schaut zurück und nach vorne: Was sind die aktuell relevantesten netzpolitischen Debatten und was erwartet uns im nächsten Jahr? Welche Themen erhalten zu wenig Aufmerksamkeit und wo gab es Erfolge für die digitale Zivilgesellschaft?\r\n\r\n","description":"\r\nEine kleine Pandemie hielt in diesem Jahr die Politik, Medien und Gesellschaft in Atem. Auch wenn das alles überlagerte, gab es leider noch viel mehr netzpolitische Debatten mehr, die etwas untergingen.\r\n\r\nDie Große Koalition befindet sich auf der Zielgeraden und traditionell ist das ein Fest für mehr Überwachungsbefugnisse, auch auf europäischer Ebene durch die aktuelle deutsche Ratspräsidentschaft. Verschlüsselung ist wichtig, soll aber trotzdem Hintertüren bekommen. IT-Sicherheit geht nur mit Staatstrojanern. Uploadfilter kommen, auch wenn das in der PR-Broschüre anders versprochen wurde. \r\n\r\nDie EU-Kommission hat sich warm gelaufen, verschiedene Gesetzgebungsverfahren wie der Digital Servce Act oder die Dauerbrenner Verordnung gegen Terrorpropaganda und e-Evidence. \r\n","recording_license":"","do_not_record":false,"persons":[{"id":1595,"public_name":"Markus Beckedahl"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11404.html","id":11404,"guid":"4c2cd189-b216-4246-88ab-8d1bb11cbe9e","logo":"/system/events/logos/000/011/404/large/logo_s.png?1605727194","date":"2020-12-28T19:20:00+01:00","start":"19:20","duration":"01:00","room":"rc2","slug":"rc3-11404-attacking_cpus_with_power_side_channels_from_software_warum_leaked_hier_strom_en","title":"Attacking CPUs with Power Side Channels from Software: Warum leaked hier Strom? (en)","subtitle":"","track":"IT-Security","type":"lecture","language":"en","abstract":"Everyone knows and loves the famous line from the cinematic masterpiece where the IT-Security specialist asks the CPU architect: \"Warum leaked hier Strom?\" (Why is power leaking here?).","description":"In this talk, we want to answer that question. We demonstrate how we can attack modern processors purely in software, relying on techniques from classical power side-channel attacks. We explain how we abuse the unprivileged access to energy-monitoring features of modern Intel and AMD CPUs. With PLATYPUS, we show how to steal cryptographic keys from the operating system or trusted-execution environments, and how to break kernel address-space layout randomization within seconds. Finally, we discuss the mitigations that prevent our attacks.","recording_license":"","do_not_record":false,"persons":[{"id":6937,"public_name":"Moritz Lipp"},{"id":8665,"public_name":"Michael Schwarz"},{"id":6293,"public_name":"Daniel Gruss"},{"id":12860,"public_name":"Andreas Kogler"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11406.html","id":11406,"guid":"ab2b7bae-f233-4fd0-8773-51af38d3833f","logo":"/system/events/logos/000/011/406/large/ObservingPoliceProtests.png?1605730308","date":"2020-12-28T20:40:00+01:00","start":"20:40","duration":"00:40","room":"rc2","slug":"rc3-11406-spot_the_surveillance","title":"Spot the Surveillance","subtitle":"How to Identify Police Surveillance at Protests and Large Gatherings","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"The Electronic Frontier Foundation’s Kurt Opsahl with show you how to identify surveillance technologies that law enforcement may use at protests and other public gathering to spying on people exercising their fundamental rights. Learn how to spot the surveillance so you can advocate effectively for the policies necessary to protect your rights and bring transparency to the police surveillance.","description":"If you attend a protest, demonstration or any mass gathering in a public space, the police are probably surveilling you. Whether it’s sophisticated facial recognition, ubiquitous video recording, or the instant analysis of our biometric data, law enforcement agencies are following closely behind their counterparts in the military and intelligence services in acquiring privacy-invasive technologies, from automated license plate readers to body-worn cameras to drones and more.  In this talk, Kurt Opsahl with show you how to identify surveillance technologies in use:\r\n\t• Where to look for these devices\r\n\t• How these technologies look\r\n\t• How these technologies function\r\n\t• How they are used by police\r\n\t• What kind of data they collect\r\n\t• Where to learn more about them\r\nKnowledge is power. Knowing what technologies are in use can help you understand the threats to your privacy and security, as well as tools to advocate for limits on police use of surveillance that may chill people’s rights to express themselves on public issues.  Just as analog surveillance historically has been used as a tool for oppression, policymakers and the public must understand the threat posed by emerging technologies to successfully defend human rights in the digital age. ","recording_license":"","do_not_record":false,"persons":[{"id":4020,"public_name":"Kurt Opsahl"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11576.html","id":11576,"guid":"fb1548fe-5a09-422f-a1f3-426e1f7c7f62","logo":null,"date":"2020-12-28T21:40:00+01:00","start":"21:40","duration":"00:30","room":"rc2","slug":"rc3-11576-turning_facial_recognition_against_the_police","title":"Turning Facial Recognition Against the Police","subtitle":"","track":"Art \u0026 Culture","type":"lecture","language":"en","abstract":" In October 2020, Paolo Cirio collected 1000 public images of police officers in photos taken during protests in France and processed them with Facial Recognition software. ","description":"Cirio then created an online platform with a database of the resulting 4000 faces of police officers to crowdsource their identification by name. Cirio also printed the officers’ headshots as street art posters and posted them throughout Paris to expose them in the public space. This provocation generated reactions by the French Interior Minister, police unions and families, major media outlets, and the communities of protesters in France. \r\n\r\nThe project Capture comments on the potential uses and misuses of Facial Recognition and Artificial Intelligence by questioning the asymmetry of power at play. The lack of privacy regulations of such technology eventually turns against the same authorities that urge the use of it. \r\n\r\nUltimately, as an activist, Cirio introduced a campaign to ban Facial Recognition technology in all of Europe by organizing a petition in collaboration with privacy organizations. ","recording_license":"","do_not_record":false,"persons":[{"id":13229,"public_name":"Paolo Cirio"}],"links":[{"url":"https://ban-facial-recognition.eu/","title":"Ban Facial Recognition"}],"attachments":[]}],"chaosstudio-hamburg":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11591.html","id":11591,"guid":"936c3294-d139-4ba5-85ad-e14ea6766da2","logo":null,"date":"2020-12-28T12:00:00+01:00","start":"12:00","duration":"03:00","room":"chaosstudio-hamburg","slug":"rc3-11591-digitales_klassenzimmer","title":"Digitales Klassenzimmer","subtitle":"So geht Freie Schulsoftware","track":"Community","type":"lecture","language":"de","abstract":"In diesem Workshop können Lehrerinnen und Lehrer, Schüler.innen und andere Interessierte in Freie Schulsoftware reinschnuppern.\r\nBigBlueButton? Moodle? Nextcloud? Das sind die digitalen Klassenzimmer der Zukunft. ","description":"In diesem Workshop können Lehrerinnen und Lehrer, Schüler.innen und andere Interessierte in Freie Schulsoftware reinschnuppern. BigBlueButton? Moodle? Nextcloud? Das sind die digitalen Klassenzimmer der Zukunft. Verschiedene Referent.innen aus dem Bildungsbereich zeigen euch, wozu die Programme gut sind und was es da zu entdecken gibt. Wir freuen uns auf einen regen Austausch und möchten digitale Bildung gemeinsam gestalten.","recording_license":"","do_not_record":false,"persons":[{"id":14137,"public_name":"Jessica Wawrzyniak"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11510.html","id":11510,"guid":"89ec66c8-f22d-4904-89f6-d2300bea3494","logo":null,"date":"2020-12-28T15:10:00+01:00","start":"15:10","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11510-wie_konnen_wir_das_digitale_museum_aufhalten","title":"Wie können wir das digitale Museum aufhalten?","subtitle":"","track":"Art \u0026 Culture","type":"lecture","language":"de","abstract":"Museen digitalisieren verstärkt ihre Sammlungen und Dokumentationen. Das geht etwas schnell, denn eigentlich wird ihre gesellschaftliche Rolle gerade stark hinterfragt, besonders an kolonialen Erwerbungen entzündet sich die Debatte. Der Vortrag beschreibt wie diese aktuellen Auseinandersetzungen enger mit der Digitalisierung in Museen zusammengedacht werden müssen.","description":"Museen sind jetzt digital. Die kolonialen Erwerbungen und Raubgüter sind jetzt 3d-Scans. Die rassistischen Klassifizierungen sind jetzt Meta-Daten. Die sexistischen Gemälde sind jetzt Bilddateien. Die Kurator*innen sind jetzt Daten-Management. Die Social Media Abteilung sind jetzt Kurator*innen. Und im Lockdown findet die Führung in Instagram-Stories und Youtube-Videos statt. Die Liste an ethischen Bedenken sollte lang sein. Doch die digitalen Museen walzen munter voran, allein in Berlin müssen ja 5.000.000 Objekte der staatlichen Museen in die Datenbank, 5.000 wurden schon vor 10 Jahren zu Google Arts \u0026 Culture gegeben. Die Behauptung des \"geteilten Kulturerbes\" wird in der Sharingökonomie und in den Datensilos zur Farce - es regiert auch im digitalen Raum der Besitzanspruch und die Deutungshoheit des \"Universalmuseums\". Der Vortrag umreißt das Problem und macht Vorschläge, wie die bestehende Vorstellung vom digitalen Museum hinterfragt, entschleunigt und mit Gegenentwürfen konfrontiert werden kann.","recording_license":"","do_not_record":false,"persons":[{"id":12759,"public_name":"Lukas Fuchsgruber"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11588.html","id":11588,"guid":"798fda2f-a380-498b-a64c-8549b3ddae89","logo":"/system/events/logos/000/011/588/large/SPBSFX.jpg?1607525208","date":"2020-12-28T16:10:00+01:00","start":"16:10","duration":"01:00","room":"chaosstudio-hamburg","slug":"rc3-11588-x-ray_free_electron_lasers_a_new_paradigm_in_science","title":"X-ray free electron lasers: A new paradigm in science ","subtitle":"","track":"Science","type":"lecture","language":"en","abstract":"New research opportunities, a flood of scientific data and the future of data storage","description":"More than 60 years ago Rosalind Franklin’s X-ray image of DNA helped solve the structure of this important molecule. Today scientists at the world's largest laser, European XFEL, generate thousands of images every second. This data is used to unravel the structures and movements of viruses, nanoparticles, plasmas and magnetic materials. How do researchers store and analyse petabytes of data arriving at a rate of thousands of frames a second? And how could basic research into magnetism and materials pave the way to new data storage media for the future? ","recording_license":"","do_not_record":false,"persons":[{"id":13712,"public_name":"Prof. Dr. Robert Feidenhans’l"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11400.html","id":11400,"guid":"5b59a1ed-71be-447d-8f71-509d3dcf9fc4","logo":"/system/events/logos/000/011/400/large/block.png?1605825716","date":"2020-12-28T19:20:00+01:00","start":"19:20","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11400-building_blocks_of_decentralization","title":"Building Blocks of Decentralization","subtitle":"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"Much of our time online continues to be spent in centralized silos. A wide range of projects continue to chip away at building decentralized alternatives, but it's fair to say that decentralized platforms continue to play catch up.\r\n\r\nThis talk looks at a few of the key problems underlying many schemes for decentralization, and reflect on how different projects are tackling them and what remains challenging. In particular decentralized platforms grapple not only with how to efficiently scale, how to balance resiliency and capacity, how to name and discover content and users, but also have to consider privacy and security.\r\n\r\nIn 2020 we've seen increased adoption of both federated (matrix, activity pub) and decentralized (ssb, ipfs, cryptocurrencies-writ-large) platforms. ","description":"Lots of decentralized engineering has been happening this year.\r\n\r\nThe Interplanetary Filesystem restructured its DHT to get content discovery times below 5 seconds. Matrix grew to more than 2,500 federated servers, and got a contract with the German education system. Planetary.social extended the Secure Scuttlebutt gossip protocol to mobile. The crypto-currency community has settled on some strategies for parallel computation to address scaling pains, and are continuing to work on building systems for decentralized governance and organizations.\r\n\r\nOn the flip side, there remain plenty of big questions these systems are hitting. You can't just keep scaling a DHT without the overhead of connection setups and metadata overwhelming performance. Consistency remains computationally expensive at scale, and decentralization of power and wealth are not solvable with engineering alone.","recording_license":"","do_not_record":false,"persons":[{"id":4821,"public_name":"Will Scott"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11381.html","id":11381,"guid":"6a475b25-bb63-46f5-a98b-5c4a71540ab0","logo":"/system/events/logos/000/011/381/large/Formsignal.png?1605394282","date":"2020-12-28T21:00:00+01:00","start":"21:00","duration":"02:00","room":"chaosstudio-hamburg","slug":"rc3-11381-remote_stellwerk_experience","title":"remote Stellwerk Experience","subtitle":"Schaffst du es, den Zug fahren zu lassen?","track":"Hardware \u0026 Making","type":"lecture","language":"de","abstract":"Eisenbahnen fahren nicht einfach so drauflos: wegen der langen Anhaltewege könne man \"auf Sicht\" nur mit sehr niedriger Geschwindigkeit unterwegs sein (10 km/h). Stattdessen zeigen die Signale (quasi die Ampeln) den Triebfahrzeugführer:innen an, dass der nächste Streckenabschnitt frei ist und mit einer bestimmten Geschwindigkeit befahren werden kann. Die Signale werden von Stellwerken aus gesteuert, wo Fahrdienstleiter:innen für jeden Zug bestimmen, wohin er gelenkt werden soll.\r\n\r\nIn unserem Lehrstellwerk in Aumühle bei Hamburg haben wir fünf originalgetreue Stellwerke, an denen Fahrdienstleiter:innen ausgebildet werden. In unserer Remote-Session habt ihr die Gelegenheit, die Bedienung eines Stellwerks selbst auszuprobieren (wir sind eure \"Remote Hands\") und zu versuchen, einen Zug erfolgreich und unfallfrei fahren zu lassen! Die Stellwerke sind echt, aber die Züge nur simuliert.","description":"Das Lehrstellwerk der Vereins Verkehrsamateure und Museumbsbahn e. V. wurde ursprünglich von der Deutschen Bundesbahn in den 1960er Jahren aufgebaut. Als in den 1980er Jahren die Farhdienstleiter:innen-Ausbildung neu organisiert wurde, wurde das Lehrstellwerk zunächst an den Verein Freunde der Eisenbahn (FdE) und schließlich an den VVM in Hamburg abgegeben.\r\n\r\ndl8xas und stb betreuen als ehrenamtliche Mitarbeiter das Stellwerk, kümmern sich um den Erhalt der Technik, und erklären interessieren Menschen, wie Stellwerke und die Eisenbahnsicherungtechnik in Deutschland und angrenzenden Ländern funktioniert.\r\n\r\nWir starten unser Event mit einer kleinen Einleitung, in der wir einige Grundbegriffe erklären und den Ablauf einer Zugfahrt aus Stellwerkssicht vorführen. Dann seid ihr dran: über eine Videokonferenz kann jeweils ein:e Kandidat:in sehen, was die Bediener:in des Stellwerks sieht, und Anweisung geben, welche Hebel gezogen und welche Knöpfe gedrückt werden sollen. Wenn alles richtig gemacht wird, kann man den Signalhebel auf \"Fahrt\" legen, und der (virtuelle) Zug setzt sich in Bewegung.\r\n\r\nWir stellen euch rechtzeitig vor Beginn ein kleines \"Cheat Sheet\" mit den verschiedenen Hebeln, Tasten und Anzeigefeldern zur Verfügung, damit ihr uns genau sagen könnt, wo wir hinschauen sollen, und was wir für euch betätigen sollen.\r\n\r\nIm Anschluss stehen wir in einem BBB/Jitsi für weitere Fragen zur Verfügung.","recording_license":"","do_not_record":false,"persons":[{"id":12472,"public_name":"stb"},{"id":12546,"public_name":"dl8xas"}],"links":[{"url":"https://www.youtube.com/watch?v=9o74rv90Hjk","title":"Video mit einer Erklärung des Ablaufs einer Zugfahrt"},{"url":"https://vvm-museumsbahn.de/?id=300","title":"Homepage Eisenbahnmuseum Lokschuppen Aumühle"}],"attachments":[]}],"restrealitaet":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11589.html","id":11589,"guid":"3f47f2c6-e4b3-454a-9955-07f577ca84af","logo":null,"date":"2020-12-28T12:00:00+01:00","start":"12:00","duration":"01:00","room":"restrealitaet","slug":"rc3-11589-5_jahre_blutiger_deal_mit_libyen","title":"5 Jahre blutiger Deal mit Libyen","subtitle":"Ein Einblick in die zivile Luftaufklärung von Sea-Watch","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Gemeinsam mit der Schweizer NGO Humanitarian Pilotes Initiative(HPI) betreibt Sea-Watch seit dem Frühjahr 2017 ein ziviles Aufklärungsflugzeug über dem zentralen Mittelmeer namens Moonbird.\r\nEin großer Bestandteil der Arbeit ist  auch die Dokumentation von Menschenrechtsverletzungen auf See durch die so genannte libysche Küstenwache und unterlassener Hilfeleistung von Handelsschiffen.\r\nDie Crew dokumentiert während ihrer Mission Seenotfälle auf der zentralen Mittelmeerroute, und versucht Rettungsmaßnahmen aus der Luft einzuleiten. Dabei werden sie Zeugen von verzweifelten Fluchtversuchen von Menschen, die in hochseeuntauglichen Booten die gefährliche Fahrt von Libyen nach Europa wagen und dabei ihr Leben riskieren.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":7110,"public_name":"Ruben Neugebauer"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11499.html","id":11499,"guid":"bf48b8e4-1f18-42a8-a574-1169180225fd","logo":null,"date":"2020-12-28T14:00:00+01:00","start":"14:00","duration":"00:40","room":"restrealitaet","slug":"rc3-11499-radikale_tochter","title":"Radikale Töchter","subtitle":"Macht kommt von Machen","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Wir sind die Radikalen Töchter und schlagen da auf, wo es passiert: auf dem Land, in Dörfern und Kleinstädten. Wir durchkämmen Deutschland auf der Suche nach aufgeweckten, engagierten Menschen und verbreiten in Delitzsch, Gera und Jamlitz die frohe Botschaft der Aktionskunst. ","description":"bye bye 17 Minuten Politikunterricht in der Woche, hello Ausbildungscamps in Aktionskunst. Wir sind die Radikalen Töchter und schlagen da auf, wo es passiert: auf dem Land, in Dörfern und Kleinstädten. Wir durchkämmen Deutschland auf der Suche nach aufgeweckten, engagierten Menschen und verbreiten in Delitzsch, Gera und Jamlitz die frohe Botschaft der Aktionskunst. Macht kommt von Machen. Unser Trainingsplan aus Aktion, Kunst und Politik hinterlässt eine kritische Masse von Menschen, die für die Demokratie brennt. In den nächsten Jahren werdet ihr von ihnen hören.","recording_license":"","do_not_record":false,"persons":[{"id":13625,"public_name":"Cesy Leonhard"},{"id":13626,"public_name":"Katharina Haverich"},{"id":13627,"public_name":"Josephin Haardt"}],"links":[{"url":"https://radikaletoechter.de/","title":"Radikale Töchter"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11439.html","id":11439,"guid":"edd342b9-2a4c-4542-b385-ddf6dcc520b8","logo":"/system/events/logos/000/011/439/large/Milk-Tea-Alliance.jpg?1605828341","date":"2020-12-28T18:00:00+01:00","start":"18:00","duration":"01:00","room":"restrealitaet","slug":"rc3-11439-milk_tea_alliance_let_s_make_protest_cute_again","title":"Milk Tea Alliance, let's make protest cute again! ","subtitle":"How a beverage reminiscent of colonial past unites the young protestors online across Asia against authoritarian China ","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"In this pre-recorded performative talk, I will explain the recent formation of \"Milk Tea Alliance\" and other political memes in southeast Asia, their cultural roots and sociopolitical conditions. I would highlight the creativity and sense of humour in the way how young generation of pro-democracy protestors in Asia utilise social media and online mobilisation to gain international media attention and rapport as a strategy to supplement their social movements. ","description":"Following my talk \u003ci\u003eRiver Crab, Harmony and Euphemism\u003c/i\u003e at the camp last year, I continue to decipher online civil disobedience and resistance in Asia in an informative and lighthearted way, providing the cultural and sociopolitical background for the chaotic and curious audience who don’t know where to start.\r\n \r\nIn this pre-recorded performative talk, I will explain the recent formation of Milk Tea Alliance, taking examples from social media posts, footage from protest sites, as well as widely circulated pro-democracy propaganda posters. Then I will review the cultural roots and sociopolitical conditions of such an alliance initiated by young protesters in Taiwan, Hong Kong and Thailand, united by their same goal to fight against authoritarianism and pursue a democratic future. What's the power of this hashtag? What has happened in these places? What do they want to change? Will they succeed? I don't promise to give you definite answers, but I would like to share a plethora of opinions from key figures in these movements and explain the mentality of these young people. \r\n\r\nI intend to highlight the creativity and sense of humour in the way how young generation of pro-democracy protestors utilise social media and online mobilisation to gain international media attention and rapport as a strategy to supplement their off-line movements. \r\n\r\nI plan to record myself making 3 different types of milk tea from Taiwan, Hong Kong and Thailand and add these videos as the background of my talk recorded in front of a green screen. So it’s not only about politics, it’s also a tutorial for you to learn how to make delicious milk tea while enjoying RC3 in the comfort and safety of your home. \r\n\r\nTo win the battle at the international front line through meme-powered solidarity, let’s make protests cute again!","recording_license":"","do_not_record":false,"persons":[{"id":8891,"public_name":"Brusda"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11562.html","id":11562,"guid":"ff9d603b-4d85-4fc9-9899-44c0c424c386","logo":null,"date":"2020-12-28T20:00:00+01:00","start":"20:00","duration":"00:40","room":"restrealitaet","slug":"rc3-11562-korperverletzung_im_amt_durch_polizeibeamt_innen","title":"Körperverletzung im Amt durch Polizeibeamt:innen","subtitle":"Ergebnisse aus dem Forschungsprojekt KviAPol","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Polizeibeamt:innen, die die gesetzlichen Grenzen für den Einsatz von Gewalt überschreiten, machen sich gemäß § 340 StGB wegen Körperverletzung im Amt strafbar. Den amtlichen Statistiken zufolge werden die allermeisten angezeigten Fälle durch die Staatsanwaltschaften eingestellt; wenig bekannt ist bislang über das Dunkelfeld dieses Deliktsbereichs. Der Vortrag präsentiert Ergebnisse aus dem Forschungsprojekt KviAPol, das erstmals für Deutschland systematisch übermäßige polizeiliche Gewaltanwendungen untersucht. Welche Personen sind in welchen Situationen auf welche Weise von übermäßiger polizeilicher Gewalt betroffen? Warum entscheiden sie sich für oder gegen eine Anzeige? Wie kommt es zu der hohen Einstellungsquote? Wie wird in der Polizei mit derartigen Verfahren umgegangen? Welche Rolle spielen Rassismus und Diskriminierungserfahrungen?","description":"","recording_license":"","do_not_record":false,"persons":[{"id":13610,"public_name":"Tobias Singelnstein"}],"links":[{"url":"https://kviapol.rub.de","title":"Forschungsprojekt KviAPol"}],"attachments":[]}]}},{"index":3,"date":"2020-12-29","day_start":"2020-12-29T09:00:00+01:00","day_end":"2020-12-30T04:00:00+01:00","rooms":{"rc1":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11574.html","id":11574,"guid":"221560a2-7470-4e90-9190-99a2bef53238","logo":null,"date":"2020-12-29T12:00:00+01:00","start":"12:00","duration":"00:40","room":"rc1","slug":"rc3-11574-globalisierung_digitalisierung_und_die_wachstumsfrage","title":"Globalisierung, Digitalisierung und die Wachstumsfrage","subtitle":"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Auch wenn CO2-Moleküle und Corona-Viren naturwissenschaftlich nicht vergleichbar sind, bilden sie eine seltsame Allianz -- sowohl ihre Ursachen, als auch ihre Konsequenzen betreffend. Die digitale Revolution erweist sich als DER Brandbeschleuniger sämtlicher Krisen. Das dringend benötigte Überlebensprogramm wäre ohne prägnanten Rückbau geldbasierter Versorgungssysteme, De-Globalisierung sowie einer Zurückdrängung der aktuellen Technologieabhängigkeit nicht zu haben. Suffizienz, Sesshaftigkeit, moderne Subsistenz und kürzere Versorgungsketten würden dann zu wichtigen Gestaltungsoptionen.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":13636,"public_name":"Prof. Dr. Niko Paech"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11366.html","id":11366,"guid":"cbed44db-2417-49f1-b401-2f133044bfbb","logo":"/system/events/logos/000/011/366/large/tale-png.png?1605181461","date":"2020-12-29T13:00:00+01:00","start":"13:00","duration":"00:40","room":"rc1","slug":"rc3-11366-ramming_enclave_gates_a_systematic_vulnerability_assessment_of_tee_shielding_runtimes","title":"Ramming Enclave Gates: A Systematic Vulnerability Assessment of TEE Shielding Runtimes","subtitle":"","track":"IT-Security","type":"lecture","language":"en","abstract":"This talk presents an extensive security analysis of trusted-execution environment shielding runtimes, covering over two years of continuing research and leading to 7 CVE designations in industry-grade Intel SGX enclave SDKs. ","description":"For the first time, we develop a systematic way of reasoning about enclave shielding responsibilities categorized across 11 distinct classes across the ABI and API tiers. Our analysis revealed over 40 new interface sanitization vulnerabilities, and we developed innovative techniques to aid practically exploitation through among others CPU register poisoning, timer-based single-stepping, rogue CPU exception handlers, and side-channel-based cryptanalysis. We finally analyze tendencies across the landscape and find that developers continue to make the same mistakes, calling for improved vulnerability detection and mitigation techniques.\r\n\r\nThis talk overviews the security and state of practice of today's Trusted Execution Environment (TEE) shielding runtimes from both industry and research. Our systematic analysis uncovered over 40 re-occurring enclave interface sanitization vulnerabilities in 8 major open-source shielding frameworks for Intel SGX, RISC-V, and Sancus TEEs. The resulting vulnerability landscape enables attackers to poison victim programs through both low-level CPU state, including previously overlooked attack vectors through the x86 status flags and floating-point co-processor, as well as through higher-level programming constructs such as untrusted pointer arguments passed into the shared address\r\nspace.\r\n\r\nWe develop new and improved technique to practically exploit these vulnerabilities in several attack scenarios that leak full cryptographic keys from the enclave or enable arbitrary remote code reuse. Following extended responsible disclosure embargoes, our findings were assigned 7 designated CVE records and led to numerous security patches in the vulnerable open-source projects, including the Intel SGX-SDK, Microsoft's Open Enclave, Google's Asylo, and the Rust compiler. \r\n\r\nOur findings highlight that emerging TEE technologies, such as Intel SGX, are _not_ a silver-bullet solution and continue to be misunderstood in both industry and academia. While promising, we explain that TEEs require extra scrutiny from the enclave developer and we set out to identify common pitfalls and constructive recommendations for best practices for enclave interface sanitization. Throughout the talk, we overview shielding responsibilities and argue that proper enclave hygiene will be instrumental to the success of the emerging Intel SGX ecosystem. Additionally, we point to several subtle properties of the Intel x86 complex instruction set considerably increase the attack surface for enclave attackers and require the end developer to be aware of their respective shielding runtime or apply additional sanitizations at the application level itself.","recording_license":"","do_not_record":false,"persons":[{"id":12439,"public_name":"Jo Van Bulck"},{"id":12440,"public_name":"Fritz Alder"}],"links":[{"url":"https://www.zdnet.com/article/manual-code-review-finds-35-vulnerabilities-in-8-enclave-sdks/","title":"Manual code review finds 35 vulnerabilities in 8 enclave SDKs"},{"url":"https://github.com/jovanbulck/0xbadc0de","title":"Attack source code #1"},{"url":"https://github.com/fritzalder/faulty-point-unit/","title":"Attack source code #2"}],"attachments":[{"url":"/system/event_attachments/attachments/000/004/153/original/ccs19-tale.pdf?1605184533","title":"Technical paper #1"},{"url":"/system/event_attachments/attachments/000/004/154/original/2020_faulty-point-unit.pdf?1605184533","title":"Technical paper #2"}]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11457.html","id":11457,"guid":"487a1dc6-ccf4-42ec-97f4-33dee5973ed7","logo":null,"date":"2020-12-29T14:00:00+01:00","start":"14:00","duration":"00:40","room":"rc1","slug":"rc3-11457-patente_toten","title":"Patente töten. ","subtitle":"Wie Politik und Pharma den gerechten Zugang zum Impfstoff verhindern","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Ob sie von Biontec, Curevac oder Moderna kommen werden, schon jetzt haben sich wenige reiche Länder den Löwenanteil der aussichtsreichsten Covid-19-Impfstoffe gesichert. Dabei ist Corona erst dann vorbei, wenn es für alle vorbei ist. ","description":"Doch Europas Regierungen untergraben die globale Kooperation zur Überwindung der Gesundheitskrise und sichern das Recht auf Gewinne für die Pharmaindustrie ab. Wer sind die Gewinner, wer die Verlierer beim Wettlauf um den Impfstoff? Und was hat die Gates Stiftung damit zu tun?\r\n\r\n„Niemand ist sicher vor COVID-19, bevor nicht alle davor sicher sind. Selbst wer das Virus in seinen eigenen nationalen Grenzen besiegt, bleibt Gefangener dieser Grenzen, solange es nicht überall besiegt ist.“ Völlig zutreffend beschrieb Bundespräsident Frank Walter Steinmeier bei der Eröffnung des World Health Summit am 25. Oktober in Berlin das Wesen der Pandemie: Die Befreiung vom Virus bedarf eines globalen Handelns. Deutschland, Europa und alle anderen großen Industrienationen verhindern allerdings genau das. Eine kleine Gruppe reicher Länder, die 13 Prozent der Weltbevölkerung repräsentieren, hat sich bereits mehr als die Hälfte der zukünftigen Versorgung mit führenden COVID-19-Impfstoffen gesichert, berichtet die Hilfsorganisation Oxfam. Konkret haben die reichen Länder bereits mehr als fünf Milliarden Dosen von Impfstoffen aus den Kandidatenländern gekauft oder sind dabei, sie zu kaufen, bevor die klinischen Studien abgeschlossen sind. Weniger als 800 Millionen Dosen sind für die ärmsten Länder der Welt vorgesehen, berichtet die Duke University in einer kürzlich veröffentlichten Studie. Auch Deutschland hat solche Exklusivverträge abgeschlossen.\r\n\r\n\r\nNimmt man die richtungsweisenden Entscheidungen seit Beginn der Pandemie genauer in den Blick, wird schnell deutlich, dass die Industrienationen an einer neoliberalen Politik festhalten, die das Recht auf Gewinn für Unternehmen gegen die Menschenrechte, konkret den gerechten und gleichen Zugang zu den Impfstoffen, absichert. Diese Ordnung wird mit aller Gewalt verteidigt und das ist durchaus wörtlich zu verstehen: Betrachtet man das Ringen um die kommenden Impfstoffe, zeigt sich, wie die Krise gelöst werden soll – auf Kosten der Armen. Die Nebenwirkungen sind tödlich und werden auch die wirtschaftliche, geographische und soziale Ungleichheit dramatisch vergrößern. Es droht die Restaurierung der Zweiteilung der Welt in Nord und Süd, auch wenn deren Überwindung verbal immer wieder bekräftigt wird.\r\n","recording_license":"","do_not_record":false,"persons":[{"id":12747,"public_name":"Anne Jung, medico international"}],"links":[{"url":"https://www.medico.de/blog/privat-sticht-oeffentlich-17956","title":"Recht auf Gesundheit"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11500.html","id":11500,"guid":"58ceb0b8-be13-47e3-b44e-63762c0d955e","logo":null,"date":"2020-12-29T15:00:00+01:00","start":"15:00","duration":"01:00","room":"rc1","slug":"rc3-11500-this_is_not_a_game_de","title":"This Is Not A Game (de)","subtitle":"Eine kurze Geschichte von Q als Mindfuck-Spiel","track":"Art \u0026 Culture","type":"lecture","language":"de","abstract":"Dieser Vortrag beschreibt die Genese von QAnon u.a. aus dem Gesichtspunkt eines ARGs und versucht daraus einige Überlegungen darüber zu gewinnen, weshalb Q sich derart schnell verbreiten konnte.","description":"\"Alternate Reality Games\" sind eine relativ junge interaktive Erzählform, die einige interessante Eigenschaften hat. ARGs sind medienübergreifend, fesseln ihre Spielenden durch gemeinsames Recherchieren und Austauschen und benutzen dabei die je individuellen Leben der Spieler:innen als eigentliche Spielplattform. So können sie in kurzer Zeit sehr aktive und mitunter erstaunlich dauerhafte Gemeinschaften organisieren. \r\n\r\nWie konnte sich Qanon derart schnell verbreiten? Dieser Frage soll unter dem Gesichtspunkt eines ARGs nachgegangen werden.","recording_license":"","do_not_record":false,"persons":[{"id":9429,"public_name":"Arne Vogelgesang"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11460.html","id":11460,"guid":"596dce9c-c924-477e-a64c-f0a3484ba0c5","logo":null,"date":"2020-12-29T18:00:00+01:00","start":"18:00","duration":"00:40","room":"rc1","slug":"rc3-11460-nachrichten_aus_dem_coroninchenbau","title":"Nachrichten aus dem Coroninchenbau","subtitle":"Rechte Mobilisierung in Zeiten der Pandemie","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Welche Lessons Learned können wir aus den den Strategien der extremen Rechten im Jahr 2020 ziehen – auch in Bezug auf die Mobilisierung der AfD zur Bundestagswahl?","description":"Das Jahr 2020 waren umgerechnet sieben Rechtsextremismusexperinnenjahre. Die Mediale Diskurse drehten sich um Verschwörungsideologen auf Telegram, Mobilisierung gegen Maßnahmen zur Pandemieeindämmung auf der Straße, Reichstagstreppenwettläufe und Bürgerkriegsphantasien. \r\n\r\nAuch wenn sich das Abheften derartiger Phänomene als \"bedauerlicher Einzelfall\" in so mancher Behörde in der Vergangenheit durchaus bewährt haben mag – Es ist wichtig all diese Phänomene als Teil einer gemeinsamen Strategie der extremen Rechten zu begreifen. \r\n\r\nAuch Verschwörungsmythen sind nicht etwa mit Corona plötzlich aus dem Nichts gekommen, sondern schon lange ein elementarer Bestandteil rechtsextremer Weltbilder. Das Narrativ einer angeblichen großen Verschwörung erlaubt es nicht nur, sich selbst als \"erleuchtete\" Gruppe zu inszenieren, die einzig und allein den \"Volkswillen\" kenne und durchsetzen könne. Das Drohszenario einer angeblichen Herrschaft des Unrechts, wird auch dazu benutzt, Gewalt gegen Andersdenkende zu legitimieren. Dass Verschwörungsmythen eine wichtige Rolle bei der Radikalisierung von Attentätern spielen dürfte nicht erst seit Hanau und Halle klar sein. Die Erzählung von einer großen Medienverschwörung immunisiert Anhänger schließlich höchst effektiv gegen Kritik von außen. \r\n\r\nDas paradoxe an rechtsextremen Narrativen zu Corona ist, dass es sich hierbei um Geschichten handelt, in denen man sich zugleich als Held und Opfer sieht. Einerseits wird behauptet, \"das Volk\" stehe hinter einem und einige wenige gezielte Aktionen könnten den Funken für einen Bürgerkrieg entzünden. Andererseits wird das angebliche eigene Leid in der Coronazeit allen ernstes mit dem Holocausts und dem Schicksal von Anne Frank verglichen. Manch einer sieht seinen \"Widerstand\" gegen eine vermeintliche \"Corona-Verschwörung\" gar in der Tradition des Kampfes der Weißen Rose gegen den NS-Terror. \r\n\r\nDie Debatte um die Rolle rechtsextremer Mobilisierung bei den verschwörungsideologischen Demos der letzten Monate zeigt vor allem: Das Bild dessen, was einen Rechtsradikale ausmacht, ist in weiten Teilen der Bevölkerung veraltet. Das Wissen darüber, wie die Szene auf Telegram, Twich, TikTok und Instagram agiert und wie rechtsextreme Mobilisierung funktioniert ist nicht weit verbreitet. Eine der Folgen der ständigen Fokussierung auf einzelne Ereignisse und Phänomene: Mithilfe koordinierter Aktionen können Rechtsextremisten regelmäßig mediale Diskurse kapern. Wie kann das für die Zukunft verhindert werden?\r\n\r\nKarolin Schwarz und Katharina Nocun","recording_license":"","do_not_record":false,"persons":[{"id":12783,"public_name":"Raeuberhose"},{"id":8662,"public_name":"Katharina Nocun"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11342.html","id":11342,"guid":"6d4c6099-16e5-4d44-9b59-4c64f0216cf7","logo":null,"date":"2020-12-29T19:00:00+01:00","start":"19:00","duration":"01:00","room":"rc1","slug":"rc3-11342-tut_mal_kurz_weh_neues_aus_der_gesundheits-it","title":"Tut mal kurz weh – Neues aus der Gesundheits-IT","subtitle":"","track":"IT-Security","type":"lecture","language":"de","abstract":"The Boys are back in Town: Dieses Jahr haben sich Tschirsich und Saatjohann zusammengetan und zeigen euch unter medizinischer Aufsicht von cbro den Zustand des deutschen vernetzten Gesundheitswesen.","description":"Es erwartet euch eine Reise in die unendeckten Welten der Praxis-Serverschränke, da wo seit Jahren schon Millionen Patientendaten darauf warten ins Internet freigelassen zu werden.\r\n\r\nHier, wo es keine verbindlichen technischen Richtlinien gibt, wo das Gesetz der IT-Sicherheits-Straße zählt: 'Sicher' ist, wenn nicht drüber berichtet wird.\r\n\r\nAber auch da wo es strenge Normen und Regeln gibt, da wo die Öffentlichkeit hin schaut, passieren Dinge: Sicherheits-Protokolle werden mit der heißen Nadel gestrickt, Daten werden an die ganze Welt gespendet, und eine Kontaktverfolgung möchte in das öffentliche Internet.\r\n","recording_license":"","do_not_record":false,"persons":[{"id":9222,"public_name":"Christoph Saatjohann"},{"id":7912,"public_name":"Martin Tschirsich"},{"id":9376,"public_name":"cbro - Dr. med. Christian Brodowski"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11578.html","id":11578,"guid":"4fd7134e-e1e8-47f5-b362-864c2d830d5a","logo":null,"date":"2020-12-29T20:20:00+01:00","start":"20:20","duration":"01:00","room":"rc1","slug":"rc3-11578-zoe_beck_fireside_chat","title":"Zoë Beck – Fireside Chat","subtitle":"Lesung und Hintergrundgespräch","track":"Fireside Chat","type":"performance","language":"de","abstract":"Lesung und lockeres Gespräch mit der vielfach ausgezeichneten deutschen Bestseller-Autorin.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":13336,"public_name":"Zoë Beck"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11580.html","id":11580,"guid":"159aa64d-4952-413d-82a7-cc949febca50","logo":null,"date":"2020-12-29T21:40:00+01:00","start":"21:40","duration":"01:00","room":"rc1","slug":"rc3-11580-andreas_eschbach_fireside_chat","title":"Andreas Eschbach – Fireside Chat","subtitle":"Lesung und Hintergrundgespräch","track":"Fireside Chat","type":"performance","language":"de","abstract":"Lesung aus N.S.A. und lockeres Gespräch mit dem deutschen SciFi-Autor.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":13335,"public_name":"Andreas Eschbach"}],"links":[],"attachments":[]}],"rc2":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11360.html","id":11360,"guid":"e67833ba-7220-4d14-8cf4-73d753b94467","logo":"/system/events/logos/000/011/360/large/careables_logo_web.png?1605091270","date":"2020-12-29T12:00:00+01:00","start":"12:00","duration":"00:40","room":"rc2","slug":"rc3-11360-careables","title":"Careables","subtitle":"Open Source Hardware for Care","track":"Hardware \u0026 Making","type":"lecture","language":"en","abstract":"Welcome to Careables!\r\nCare-receivers, healthcare professionals and makers join forces to co-create careables: tailor-made open solutions that tackle permanent or temporary disability. Careables is an open and inclusive approach to healthcare based on digital fabrication and collaborative making. Our international team will share results and best practises of 3 years of co-creation and building a digital platform and a community that makes and shares open source hardware for health.\r\n","description":"We will show the latest developments that were designed and made in co-creation formats in the Netherlands, Brazil, Ghana, Italy, Nepal, Germany and the online world. Diy lightening canes, e-scooter hacks for wheelchair users, and writing aids: things that make the lives of people with disabilities easier; tools that break down barriers and allow communication, shared openly for building a world that is more accessible for diverse individuals together.\r\n\r\nPresented by: Sandra Mamitzsch, Isabelle Dechamps, Beatrice Barth, Paulien Melis and Enrico Bassi on behalf of the Careables community.","recording_license":"","do_not_record":false,"persons":[{"id":7977,"public_name":"Isabelle Dechamps"}],"links":[{"url":"careables.org","title":"Plattform for OSH for Health"},{"url":"https://youtu.be/u4ULkaobmG0","title":"2min Video_ Open Health HACKademy"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11388.html","id":11388,"guid":"72b208c4-229d-4ab1-bf30-f62bc871b17c","logo":"/system/events/logos/000/011/388/large/Hearable_Logo_RGB-01.png?1605452391","date":"2020-12-29T13:00:00+01:00","start":"13:00","duration":"00:40","room":"rc2","slug":"rc3-11388-liketohear_-_self-adjustment_of_open_source_mobile_hearing_aid_prototype","title":"liketohear - Self-Adjustment of Open Source Mobile Hearing Aid Prototype","subtitle":"intuitive enhancement and manipulation of environmental sounds","track":"Hardware \u0026 Making","type":"lecture","language":"en","abstract":"I'll speak about the liketohear framework providing an intuitive gui for self-adjusting the mobile openMHA hearing aid prototype. \r\n\r\nI want to give a brief introduction to the how-to of this DIY open source prototype, which is based on accessible hardware like Raspberry Pi. \r\nThe set-up is usable also by people who are not tech-savvy.\r\n\r\nExemplary reports of user feedback show the potential of self-adjusting of sound amplification. \r\n\r\nI give insights in the making off, the user's experiences in everyday listening situations and our visions for further developments. \r\n","description":"We developed the liketohear framework with intuitve gui control via web app for adjustments of the open source mobile hearing aid prototype. Designed for personalized field research in daily life situations this prototype is deployed on available hardware (a.o. Raspberry Pi), foolproof, portable and running for a approx. 4 hours. Environmental sound is manipulated by change of volume and frequencies emphasis. Audio levels and adjustment parameters can be logged. \r\n\r\nWe tested the liketohear framework with 57 persons in daily life situations and evaluated the user data. \r\n\r\nOriginally the liketohear framework was created for the field research within the #CitizenScience project \"Hear How You Like To Hear\" of Fraunhofer IDMT Oldenburg (supported by BMBF). ","recording_license":"","do_not_record":false,"persons":[{"id":7003,"public_name":"Peggy Sylopp"}],"links":[{"url":"https://github.com/liketohear/liketohear/","title":"liketohear Framework"},{"url":"https://github.com/m-r-s/hearingaid-prototype","title":"Mobile Hearing Aid Prototype"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11546.html","id":11546,"guid":"db11e86c-ecf8-40c0-b8d8-2f6798507146","logo":"/system/events/logos/000/011/546/large/Alpha-spectrometer_with_ceramics_in_chocolate_box.jpeg?1605911064","date":"2020-12-29T14:00:00+01:00","start":"14:00","duration":"00:40","room":"rc2","slug":"rc3-11546-measuring_radioactivity_using_low-cost_silicon_sensors","title":"Measuring radioactivity using low-cost silicon sensors","subtitle":"A DIY particle physics detector in a tin box.","track":"Hardware \u0026 Making","type":"lecture","language":"en","abstract":"This talk gives a brief introduction to natural radioactivity and shows how a detector can be built from simple photodiodes. The electronics are easy to solder for beginners and provide a hands-on opportunity for entering the exciting world of modern particle physics with a practical DIY and citizen science approach.","description":"Natural radioactivity surrounds us everywhere and is composed of different kinds of ionising radiation or subatomic particles. This talk presents a DIY particle detector based on low-cost silicon photodiodes and its relations to modern detectors like the ones developed at CERN. \r\n\r\nThe project is open hardware, easy to solder for beginners, and intended for citizen science \u0026 educational purposes. In contrast to simpler Geiger-Müller counters, this detector measures the energy of impinging particles and can distinguish in particular between alpha particles and electrons from beta decays. A cheap USB sound card or smartphone headset connection can be employed for recording the signals. Corresponding data analysis scripts written in python and related tools from particle physics research will be briefly discussed.\r\n\r\nAn introduction about terrestrial and cosmic sources of radioactivity will be given together with details on the interaction of ionising radiation in silicon. I will conclude with a discussion of interesting every-day objects that are worthwhile targets for investigation and show example measurements of characteristic alpha particle energy spectra - without using expensive vacuum equipment.","recording_license":"","do_not_record":false,"persons":[{"id":12833,"public_name":"Oliver Keller"}],"links":[{"url":"www.github.com/ozel/DIY_particle_detector","title":"Main project page, files and wiki"},{"url":"https://www.mdpi.com/1424-8220/19/19/4264/htm","title":"paper with reference measurements"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11482.html","id":11482,"guid":"2c89cb0b-e377-4f1c-b8b5-c96bcef75dea","logo":null,"date":"2020-12-29T15:00:00+01:00","start":"15:00","duration":"01:00","room":"rc2","slug":"rc3-11482-the_eu_digital_services_act_package","title":"The EU Digital Services Act package","subtitle":"how to esure that the EU meets the goal of creating systemic regulation of large online platforms with users' fundamental rights in its center","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"en","abstract":"During this event, we will discuss and propose basic safeguards that should be included in the DSA legislative package to make sure that fundamental rights of users, their empowerment and free choice are in the center of the upcoming legislation. ","description":"The Internet has seen better times. Meant to liberate users, being online has become synonymous with being locked into a few powerful platforms, being tracked across the web without options to dissent and being left at the mercy of algorithmic decision systems that curate our online lives. Fundamental principles like transparency, openness, and informational self-determination that used to be central to the early days of the Internet seem to have been undermined significantly in the past decades. \r\n\r\nIn the European Union, there is an opportunity to remedy this: the Digital Services Act is the  most significant reform of Europe’s central platform legislation, and an unparalleled opportunity to formulate a bold, evidence based vision to address some of today’s most pressing challenges. To preserve what works, to fix what is broken. The need for systemic regulation of large online platforms is justified and necessary. There is an enormous power imbalance between the large platforms and their users. In recent years, continuous scandals and increased media coverage have made it clear to the public that companies are exercising this power and making enormous profits without taking sufficient responsibility to safeguard people’s fundamental rights.\r\n\r\nFurthermore, these platforms have failed to provide meaningful transparency, and the business models that are built on data harvesting without proper safeguards do not give users adequate control, either over their data or the information they receive and impart. We are not in a position to understand the extent to which our data are being used, nor are we able to determine the extent to which automated decision-making is leveraged in the curation or amplification of content. We cannot gauge the impact of these automated processes on our exposure to diverse content, and we cannot study or prevent the discriminatory treatment of underrepresented groups.\r\n\r\nThe DSA legislative package is a unique chance to create systemic regulation of gatekeeper platforms based on human rights standards, while making the rights of users the utmost priority. In this session, we will discuss how and by what means the EU can meet this mark.  \r\n","recording_license":"","do_not_record":false,"persons":[{"id":12778,"public_name":"Eliska Pirkova"},{"id":12800,"public_name":"christoph schmon"}],"links":[{"url":"https://www.eff.org/issues/eu-policy-principles","title":"EFF DSA Postion "},{"url":"https://www.accessnow.org/eu-digital-services-act/","title":"Access Now DSA Position"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11384.html","id":11384,"guid":"08dd87aa-0226-4461-9877-e8542dc64a33","logo":"/system/events/logos/000/011/384/large/Electronic_component_ttl.jpg?1605367084","date":"2020-12-29T18:00:00+01:00","start":"18:00","duration":"00:40","room":"rc2","slug":"rc3-11384-unconventional_hdl_synthesis_experiments","title":"Unconventional HDL synthesis experiments","subtitle":"Will it synthesize?","track":"Hardware \u0026 Making","type":"lecture","language":"en","abstract":"Most synthesis goes from hardware description languages to FPGA bitstreams or ASIC designs, but what else can you do? In this talk I will demonstrate some more unconventional flows to inspire you about all the amazing experiments that are enabled by open source tools!","description":"After a short intro about the open source FPGA ecosystem, I will introduce a project by Dan Ravensloft and myself that synthesizes HDL to 74xx logic chips. Then I will cover a project of mine that synthesizes spreadsheets to HDL. And from there to 74xx logic???","recording_license":"","do_not_record":false,"persons":[{"id":11827,"public_name":"Pepijn de Vos"}],"links":[{"url":"https://github.com/Ravenslofty/74xx-liberty","title":"74xx-liberty"},{"url":"https://github.com/pepijndevos/excellerate/","title":"Exellerate"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11515.html","id":11515,"guid":"3dca975a-0899-4f6f-b0eb-375d383d0bc6","logo":"/system/events/logos/000/011/515/large/CAC_Logo_schwarz.png?1607513878","date":"2020-12-29T19:00:00+01:00","start":"19:00","duration":"01:00","room":"rc2","slug":"rc3-11515-lightkultur_in_deutschland","title":"LightKultur in Deutschland","subtitle":"Clubkultur oder wie modern ist unser Kulturbegriff?","track":"Art \u0026 Culture","type":"podium","language":"de","abstract":"In den letzten Monaten der coronabedingten Kulturkrise hat sich aus der Initiative von unterschiedlichen Clubs, Clubverbänden und durch den Support des CCC ein bundesweites Projekt entwickelt für die kulturelle Anerkenung der Clubkultur. ","description":"Die #clubsAREculture- Kampagne startet Ende 2020 mit einem Panel auf dem rC3 mit Speaker:innen wie Berthold Seliger (Konzertagent, Autor), Pamela Schobeß von der ClubCommission Berlin,  Tobias Rapp (Autor) und Judith van Waterkant (DJ, Artist).\r\n\r\nIst eine Cola light nun eine Cola oder nicht? Die Geister scheiden sich da vielleicht, allemal würde man beiden aber eine Existenz als koffeinhaltiges Erfrischungsgetränk zubilligen…\r\n\r\nSo ähnlich ist das auch mit der Kultur: Während Opern, Theater und Konzerthäuser seit jeher als Teil der Kultur anerkannt sind, haben Musikclubs damit zu kämpfen, selbstverständlich als vollwertiger Teil der Kultur betrachtet zu werden.\r\n\r\nDarf man Hochkultur also nur genießen, sich aber nicht vergnügen? Ist Clubkultur dann Kultur light oder um es mit Merz` klar mittelständischen Worten zu sagen: Lightkultur? Wo wird heute tatsächlich Kultur erlebt und wer bzw. was ist das genau? Können wir in einer Welt der Digitalisierung und Globalisierung ernsthaft noch einen Kulturbegriff anwenden der Jahrhunderte alt ist und trotzdem die Kulturpolitik bestimmt?\r\n\r\nEs geht um Kulturgeschichte, technische Entwicklungen, Medien, Generationskonflitke, Mehrwertsteuersatz, Stadt- und Bebauungsplanung, Schallschutzauflagen, Baunutzungsverordnung (BauNVO), Schutz vor Verdrängung, Alltagskultur, Gemeinwohlbezug und Freiräume.\r\n\r\n#clubsAREculture vereint Akteure, die sich für die Anerkennung der Clubkultur und Musikclubs einsetzen. Ziel wird eine Gesetzesänderung sein, die den heutigen Realitäten gerecht wird. Wir stellen unser Projekt, die Kampagne und die Petition vor.\r\n\r\nDeutschland versteht sich als Kulturnation; als das Land der Dichter und Denker, in dem Kultur einen hohen Stellenwert im gesellschaftlichen Leben einnimmt. Jedoch hat sich das Kulturverständnis – also das Verständnis von dem, was als künstlerisch wertige, schützenswerte und förderungswürdige Kultur angesehen wird – seit dem Ende des 19. Jahrhunderts nicht wesentlich verändert und umfasst mehrheitlich das, was gemeinhin als Hochkultur geclustert wird.\r\n\r\nDie Bereiche Clubkultur und Livemusikspielstätten finden hier keine Berücksichtigung, obwohl sie sich in den vergangenen Jahrzehnten zu einem wichtigen Bestandteil der kulturellen Vielfalt in Deutschland entwickelt haben.\r\n\r\nDiese „Nicht-Anerkennung“ als schützenswert und förderungswürdig durch große Teile der Kulturpolitik führt zu Herabstufungen der Clubkultur und von Livemusikspielstätten in vielen Bereichen der Politik und Verwaltung. Diesen Missständen widmen wir unsere Arbeit.\r\n","recording_license":"","do_not_record":false,"persons":[{"id":12828,"public_name":"Kordula Kunert"},{"id":14126,"public_name":"Pamela Schobeß"},{"id":14121,"public_name":"Berthold Seliger"},{"id":14122,"public_name":"Judith van Waterkant"},{"id":14124,"public_name":"Tobias Rapp"}],"links":[{"url":"www.clubsareculture.de","title":"clubsAREculture"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11569.html","id":11569,"guid":"1fc5ca1f-aeaa-4452-ae0f-143c0c443784","logo":null,"date":"2020-12-29T20:20:00+01:00","start":"20:20","duration":"01:00","room":"rc2","slug":"rc3-11569-hacking_diversity_the_politics_of_inclusion_in_open_technology_cultures","title":"Hacking Diversity: The Politics of Inclusion in Open Technology Cultures","subtitle":"Christina Dunbar-Hester","track":"Art \u0026 Culture","type":"lecture","language":"en","abstract":"A firsthand look at efforts to improve diversity in software and hackerspace communities","description":"Hacking, as a mode of technical and cultural production, is commonly celebrated for its extraordinary freedoms of creation and circulation. Yet surprisingly few women participate in it: rates of involvement by technologically skilled women are drastically lower in hacking communities than in industry and academia. Hacking Diversity investigates the activists engaged in free and open-source software to understand why, despite their efforts, they fail to achieve the diversity that their ideals support.\r\n\r\nChristina Dunbar-Hester shows that within this well-meaning volunteer world, beyond the sway of human resource departments and equal opportunity legislation, members of underrepresented groups face unique challenges. She brings together more than five years of firsthand research: attending software conferences and training events, working on message boards and listservs, and frequenting North American hackerspaces. She explores who participates in voluntaristic technology cultures, to what ends, and with what consequences. Digging deep into the fundamental assumptions underpinning STEM-oriented societies, Dunbar-Hester demonstrates that while the preferred solutions of tech enthusiasts—their “hacks” of projects and cultures—can ameliorate some of the “bugs” within their own communities, these methods come up short for issues of unequal social and economic power. Distributing “diversity” in technical production is not equal to generating justice.\r\n\r\nHacking Diversity reframes questions of diversity advocacy to consider what interventions might appropriately broaden inclusion and participation in the hacking world and beyond.","recording_license":"","do_not_record":false,"persons":[{"id":13228,"public_name":"Christina Dunbar-Hester"}],"links":[{"url":"https://annenberg.usc.edu/faculty/communication/christina-dunbar-hester","title":"Dunbar-Hester"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11575.html","id":11575,"guid":"19a6e064-8ef0-433c-8d0b-ca363297b467","logo":null,"date":"2020-12-29T21:40:00+01:00","start":"21:40","duration":"01:00","room":"rc2","slug":"rc3-11575-opencoil_a_roaming_speedshow","title":"OPENCOIL – A Roaming Speedshow","subtitle":"11 Künstler*innen präsentieren ihre Arbeiten auf gehackten E-Scootern ","track":"Art \u0026 Culture","type":"lecture","language":"en","abstract":"Die Ausstellung OPENCOIL setzt sich mit den Auswirkungen von Mikro-Mobilitätsdiensten auf den Stadtraum auseinander, indem sie ihre dezentrale Infrastruktur als Ausstellungsraum nutzt und gleichzeitig die Bedingungen und Auswirkungen dieser Infrastrukturen auch zum Thema macht.","description":"11 Künstler*innen wurden eingeladen, ihre Arbeiten auf einem kleinen Wifi Controller mit ~2MB Offline-Speicher zu präsentieren.\r\n\r\nDiese „digitalen Galerieräume“ werden an 11 zufällig ausgewählten E-Scootern angebracht.\r\nSo fährt die Ausstellung, von den Nutzer*Innen der Roller unbemerkt, als „roaming Speedshow“ durch die Stadt.\r\n\r\nDer aktuelle Standort der Kunstwerke kann ab dem 26. Oktober über diese Website verfolgt werden. Damit die Werke betrachtet werden können, muss die „Roller-Galerie“ im Stadtraum gefunden werden.\r\n\r\nSobald der Roller angemietet ist, erhalten die Besucher*innen über ihr persönliches Smartphone, Zugang zu dem 2MB großen Galerieraum und den ausgestellten Werken.\r\n\r\nWährend Kapazitätsbeschränkungen und die bevorzugte Vermeidung von Zusammenkünften in geschlossenen Räumen, traditionelle Galerien und Museen vor Herausforderungen stellen, zielt OPENCOIL darauf ab, die Ortsunabhängigkeit des Online mit der Materialität des Offline (und umgekehrt) zu verbinden. Die Infrastruktur der „Mikro-Mobiltitätsdienste“ wird übernommen – klimaneutral und dezentral.\r\n\r\nDie Gehwege vieler Städte auf der ganzen Welt wurden in den letzten Jahren von sogenannten 'dockless sharing vehicles' regelrecht überflutet. Mit Versprechungen von Umweltfreundlichkeit und Elektromobilität, besetzten diese Risikokapitalismus Aktivisten die Grauzone zwischen privatem und öffentlichem Raum auf den Straßen unserer Städte. Diese gewissenlose Gewissenhaftigkeit der \"Mikro-Mobilitätsdienste\" wirft jedoch wichtige Fragen zu städtischem Raum, Eigentum, Agentur, Produktion, Ökologie und sehr spätem Kapitalismus auf.\r\n\r\nWie umgehen mit der Inbesitznahme öffentlichen Raums?\r\nWelche Werkzeuge und Wege gibt es sich diesen zurückzuerobern?\r\n\r\nOPENCOIL soll nicht nur ein Pandemie-tauglicher Weg sein, um Kunst im öffentlichen Offline-Raum zu zeigen. OPENCOIL ist auch eine kreative (Um-)Nutzung von E-Scootern, ein Versuch, sich ihnen mit künstlerischen Mitteln zu nähern.\r\nGezeigt werden Arbeiten, die sich mit Fragen der Überschneidung von öffentlichem und privatem Raum, dem Umgang mit Ressourcen sowie mit Greenwashing, Risikokapitalismus und Vandalismus befassen.\r\n\r\nDie teilnehmenden Künstler*innen sind:\r\n\r\nAram Bartholl\r\nConstant Dullaart\r\nDennis de Bel \u0026 Anton Jehle\r\nJODI\r\nJonas Lund\r\nMartin Howse\r\n!Mediengruppe Bitnik\r\nRosa Menkman\r\nSarah Grant\r\nSofya Aleynikova\r\nDanja Vasiliev","recording_license":"","do_not_record":false,"persons":[{"id":13095,"public_name":"speedy"},{"id":13837,"public_name":"Scooty"}],"links":[{"url":"https://opencoil.show/","title":"OPENCOIL – a roaming speedshow"}],"attachments":[]}],"chaosstudio-hamburg":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11522.html","id":11522,"guid":"9276e4d2-2cb4-4c55-bf65-70b3b930686f","logo":null,"date":"2020-12-29T14:00:00+01:00","start":"14:00","duration":"01:00","room":"chaosstudio-hamburg","slug":"rc3-11522-mein_huren-manifest_online-lesung_und_gesprach_mit_undine_de_riviere","title":"„Mein Huren-Manifest“ – Online-Lesung und Gespräch mit Undine de Rivière","subtitle":"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Über Prostituierte glaubt jeder Bescheid zu wissen: Huren verkaufen ihre Seele. Die meisten werden zum „Anschaffen“ gezwungen. Mafiose Strukturen bestimmen das Geschäft. Mit solchen und anderen Klischees räumt die Sexarbeiterin Undine de Rivière auf. Sie gibt einen unerwartet differenzierten Einblick in die Welt zwischen BDSM-Studio, Laufhaus und Gangbang-Party.","description":"Über Prostituierte glaubt jeder Bescheid zu wissen: Huren verkaufen ihre Seele. Die meisten werden zum „Anschaffen“ gezwungen. Mafiose Strukturen bestimmen das Geschäft.\r\n\r\nMit solchen und anderen Klischees räumt die Sexarbeiterin Undine de Rivière auf. Sie gibt einen unerwartet differenzierten Einblick in die Welt zwischen BDSM-Studio, Laufhaus und Gangbang-Party und lässt Kolleginnen, Freier, Betreiber und Experten zu Wort kommen – offen und ehrlich. Ein Insiderbericht, wie es hinter den Kulissen eines Wirtschaftszweigs zugeht, über den meist nur Halbwissen und Pauschalurteile verbreitet werden – ein starker Appell für die Entkriminalisierung einer umstrittenen Berufsgruppe.\r\n\r\nIch freue mich auf viele Fragen und eine lebhafte Diskussion!","recording_license":"","do_not_record":false,"persons":[{"id":12830,"public_name":"Undine de Rivière"}],"links":[{"url":"https://undine-de-riviere.de/mein-huren-manifest/","title":"Undine de Rivière - Autorin"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11374.html","id":11374,"guid":"88faa2f9-10f6-4236-a65d-37eb215c5e8b","logo":"/system/events/logos/000/011/374/large/Study_01-crop.png?1605276402","date":"2020-12-29T15:10:00+01:00","start":"15:10","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11374-organizational_psychology_and_software_teams","title":"Organizational Psychology and Software Teams","subtitle":"Measurable Connections between Psychological Constructs and the Perception of Team Members","track":"Science","type":"lecture","language":"en","abstract":"We work and research in the field of work and organizational psychology in tech teams and companies. In this talk we will give insights into: How can software development teams be supported by organizational psychology? How can the collaboration in teams be changed measurably? Which factors have a measurable influence on the work of software development teams?","description":"Over the past decades, the interest in research and practical recommendations on innovation climate at team and organizational level has grown. Furthermore, the positive effects of flow experience have become increasingly present at work. The influence of leadership is commonly agreed, but little research has contributed to identifying the suitable leadership style for this target group supporting the presence of psychological safety and a climate for initiative. For the target group of members of product software development teams in Germany two studies were conducted in 2020. \r\n\r\nStudy 1 focused on the team climate for innovation and the experience of flow and worry (N = 323). This study identified a significantly positive relation between the perceived team climate for innovations and the individual flow experience, whereas there is no significant relation between the perceived team climate for innovations and the individual experience of worry. Gender has no moderating effect. Regarding the four dimensions of the team climate for innovations, the expression of vision is relatively low for the target group of product software development teams in Germany compared to the norm tables. Participative safety is comparably high and task orientation and support for innovations are moderately distinctive. This means, all dimensions, except participative safety, need interventions in order to strengthen the team climate for innovations itself and thereby foster the flow experience. Since the extent of experiencing both flow and worry is relatively high, software product development itself and respectively the work environments seem to be stimulating, but also concerning for team members, which is why these aspects need action. Study 2 (N = 121) focuses on leadership styles and the relation to psychological safety and the climate for initiative.\r\n\r\nThis talk will give a short insight into the used psychological constructs, followed by showing some research results and giving explanations on how to make use of the findings for working in software development teams.","recording_license":"","do_not_record":false,"persons":[{"id":12455,"public_name":"Laura Sophie Aichroth"}],"links":[{"url":"https://youtu.be/1iMO9dABP2U","title":"Effecting Flow (3rd ICMRSS 2020)"},{"url":"https://www.produktbezogen.de/studie-klima-in-software-produktentwicklungsteams/","title":"Mit Flow, Führung und psychologischer Sicherheit zu mehr Innovation?"},{"url":"https://www.teamagile.org/forschung/","title":"#teamagile Forschung"},{"url":"https://www.teamagile.org/wp-content/uploads/2020/09/20200914_teamagile_Research_Report_Summer_2020.pdf","title":"#teamagile Research Report Summer 2020"}],"attachments":[{"url":"/system/event_attachments/attachments/000/004/155/original/Study_01-crop.png?1605276524","title":"Organizational Psychology in Software Teams"}]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11444.html","id":11444,"guid":"50eb8065-b6a9-459c-b301-7be614e66d9f","logo":null,"date":"2020-12-29T16:00:00+01:00","start":"16:00","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11444-etherify_-_bringing_the_ether_back_to_ethernet","title":"Etherify - bringing the ether back to ethernet","subtitle":"Primitive soft tempest demos: exfiltrating data via leakage from ethernet and more :)","track":"IT-Security","type":"lecture","language":"en","abstract":"In this talk i will describe shortly the concept of soft tempest, and show a demo of etherify and sonify. Etherify uses radio frequency  leakage from ethernet to exfiltrate data. Sonify uses ultrasound. \r\nBoth demos by design use very primitive tools and hardware, and are easy to replicate.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":12764,"public_name":"Jacek Lipkowski SQ5BPF"}],"links":[{"url":"https://lipkowski.com/etherify","title":" Etherify - bringing the ether back to ethernet"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11385.html","id":11385,"guid":"8055a3c3-f932-4d97-aa61-39cf6d01c352","logo":null,"date":"2020-12-29T17:00:00+01:00","start":"17:00","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11385-divoc_forever","title":"#DiVOC Forever","subtitle":"Accept no substitutes!","track":"Community","type":"lecture","language":"en","abstract":"DiVOC - Digitally distributed Online Chaos - is a series of online gatherings that has been happening in Chaos orbit during 2020. DiVOC is not a substitute for all those meetings that we so bemoan to not have been able to attend in person, but it did create a legacy that might indeed remain useful well into the future.","description":"The pandemic has led to a the cancellation of various Chaos events that a multitude of creatures would have loved to attend in 2020. Stepping in at the dates suddenly left unbooked in organisers' and participants' calendars, digitally distributed online Chaos aka DiVOC has been happening instead. From a predictably chaotic starting state, a rather unpredicted degree of self-organisation and complexity quickly began to emerge, with a dedicated community carrying a growing pool of experience and lessons learned forward through a series of events as the year progressed. In this talk, we would like to walk you through a behind-the-scenes review, highlighting a variety of perspectives, and in doing so explore how DiVOC is quite fundamentally different from yet-another-conference-moved-online-by-necessity. DiVOC is not a substitute for all those meetings that we so bemoan to not have been able to attend in person, but it did create a legacy that might indeed remain useful well into the future. We will emphasize the community aspect and, in the true spirit of DiVOC, invite you to start participating.","recording_license":"","do_not_record":false,"persons":[{"id":12472,"public_name":"stb"},{"id":12502,"public_name":"bruttl"},{"id":8577,"public_name":"Benjamin Wand"},{"id":12269,"public_name":"voidptr"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11561.html","id":11561,"guid":"2a5c5715-f525-4459-99e1-415393d2d75e","logo":null,"date":"2020-12-29T18:00:00+01:00","start":"18:00","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11561-wie_nerds_uberleben_wenn_pizza_de_down_ist","title":"Wie Nerds überleben, wenn pizza.de down ist","subtitle":"Prepping, hamstern, einen Vorrat haben oder nur aufs Beste hoffen?","track":"Science","type":"lecture","language":"de","abstract":"Stromausfall im Münsterland, Corona selbst oder die unterbrochenen weltweiten Lieferketten dadurch. Eine überschaubare Vorbereitung jeder*s Einzelen ist wichtig, denn die Hoffnung, dass \"der\" Katastrophenschutz es schon richten wird, ist zum Scheitern verurteilt. Hintergründe, Einordnungen, praktische Tips, Hinweise zum persönlichen Vorratsregal","description":"Unsere Abhängigkeit von den KRITIS KRItischenInfrsStrukturen ist groß. Doch Bank, Logistik und Verwaltung haben Viele dabei nicht auf dem Schirm. Und doch sind sie Systemrelevant. Nicht nur Krankenhäuser, Strom und Wasser. \r\nIch möchte vorstellen, warum ein frühzeitiges, anlassloses vorbereiten wichtig ist, denn sich erst zu kümmern, wenn es soweit ist, ist leider zu spät. Im Frühjahr im Baumarkt schnell ein paar FFP2 Masken holen? Die Regale waren leer. \r\nDamit euch die vorhersehbaren Dinge nicht ausgehen, schauen wir uns gemeinsam die Struktur vom Rettungswesen, den Katastrophenschutz und den Verwaltungsebenen an. Warum stoppen Katastrophen an Landesgrenzen (sic!) ? Was kann der KatS wirklich?\r\nWelche Dinge helfen mir, sicher(er) eine unvorhergesehene Situation zu überstehen? Reicht der Supermarkt gegenüber und der Pizzaservice wirklich?\r\nWelche Hinweise gibt das BBK und warum tuen sie es? Ist es \"einfach nur Hamstern\"?\r\n\r\nGrundlage der gemeinsamen Besprechung ist die Broschüre \"für den Notfall vorgesorgt\" von bbk.bund.de . Auch wenn wir papier sparen wollen, es ist Sinnvoll, die vorher auszudrucken. Bei Stromausfall können einige Wenige von euch noch drucken, aber das sind die Wenigsten. \r\nHinterher habt ihr eine für euch optimierte Liste, mit denen ihr eure Vorbereitung gut einschätzen könnt und wisst, warum ihr was davon brauchen (könntet).","recording_license":"","do_not_record":false,"persons":[{"id":12840,"public_name":"kritis"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11389.html","id":11389,"guid":"b186405e-dd42-4596-92a7-16899ab2e551","logo":"/system/events/logos/000/011/389/large/IMG_20191230_201823.jpg?1605451160","date":"2020-12-29T19:00:00+01:00","start":"19:00","duration":"02:00","room":"chaosstudio-hamburg","slug":"rc3-11389-twilight_-_midi_broadcasting_ice_sculpture","title":"Twilight - MIDI Broadcasting Ice Sculpture","subtitle":"Open Online MIDI Sound Art Happening","track":"Art \u0026 Culture","type":"concert","language":"en","abstract":"Illuminated Ice blockes are melting. \r\nThe waterdrops trigger sensors. For the first time the data stream is provided as MIDI stream over internet. \r\nWe invite any artists to use the MIDI stream for sound or other art works and upload them as collective art work.","description":"Watch videos,, see links below","recording_license":"","do_not_record":false,"persons":[{"id":7003,"public_name":"Peggy Sylopp"}],"links":[{"url":"https://github.com/pgys/twilight_framework/blob/master/howto_twilight.pdf","title":"Twilight Framework"},{"url":"https://vimeo.com/176186171","title":"Twilight @c-base, 2016, video by epunk"},{"url":"https://donaugang.wordpress.com/2018/01/29/twilight-sylopp/","title":"Donau Ecke Ganghofer, Projektraum, solo exhibition 2017-2018"},{"url":"https://youtu.be/EwxAIooPiBM","title":"\"Twilight I\" Ice Installation at Gallery \"Odra Zoo\", Stettin (Polen), 2012 "},{"url":"http://www.tanzforumberlin.de/produktion/polar-werkschau/","title":"“POLAR” Tanzforum Berlin, 2009 "}],"attachments":[]}],"restrealitaet":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11501.html","id":11501,"guid":"68ce1223-7aaa-4554-bab8-3944e8bb891f","logo":null,"date":"2020-12-29T13:30:00+01:00","start":"13:30","duration":"00:40","room":"restrealitaet","slug":"rc3-11501-nazis_in_games","title":"Nazis in Games","subtitle":"Depiction, Normalization, Consequences","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"The depiction of Nazis in games tends to downplay their atrocities and facilitate the normalization of fascist aesthetics and ideologies. Even in a playful and lighthearted context, this normalization has consequences that can and should be avoided by everyone in gaming communities – including developers, content creators, and players.","description":"World War II might be just one of many historical settings in games, but the representation of Nazis makes it a particularly tricky one. Especially if developers are trying to sell an entertainment product and provide players with all the freedom they might wish for, they frequently decide not to depict the Holocaust, for example. Such a decision, however, contributes to an embellished picture of Nazi Germany, which is then offered to players – some of which are apparently craving Nazi content. Their ideology, weaponry, and aesthetics seem to appeal to certain players in a peculiar way, as can be seen in user-created content, profiles, and discussions.\r\nNo matter what the intention behind such behavior is, the abundance of Nazi representations in gaming communities has harmful consequences. By keeping the line between role-play and actual propagation of fascist ideologies blurry, gaming communities make themselves a rather uncomfortable place for all but the most privileged of players, while at the same time offering an excellent playground for actual fascists. Players, moderators, and developers regularly face backlash when advocating for more inclusive communities – at least whenever making a positive change would require dropping supposedly “edgy” behavior or content in an environment that has long been used to it.\r\nTackling these issues demands more awareness and responsibility from all involved parties, from the players to the developers and their marketing divisions. Luckily, we could recently witness various good practice examples of ways to oppose fascism in gaming. Such examples are still rare, they require effort and dedication, but they harbor promise of a better future for gaming – for everyone except literal Nazis.\r\n","recording_license":"","do_not_record":false,"persons":[{"id":13612,"public_name":"Manuel (EEL) Manhard"}],"links":[{"url":"https://keinenpixeldenfaschisten.de/","title":"Keinen Pixel den Faschisten"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11354.html","id":11354,"guid":"7b85d1bd-a9e8-4057-95be-81156da5abd0","logo":null,"date":"2020-12-29T20:00:00+01:00","start":"20:00","duration":"02:00","room":"restrealitaet","slug":"rc3-11354-die_alternativlose_umverteilungs-gala","title":"Die alternativlose Umverteilungs-Gala! ","subtitle":"mv -r grunewald/money everyone/money ","track":"Ethics, Society \u0026 Politics","type":"performance","language":"de","abstract":"Das Quartiersmanagement Grunewald präsentiert innovative Interventionen im Villenviertel in einer flamboyanten Umverteilungs-Show! Lassen Sie sich anstiften von Spass und Spannung des autonomen Streetworking! Hands-On-Wirtschaftspolitik muss nicht langweilig sein! Es erwartet Sie ein Feuerwerk der Enteignungs-Best-Practice-Beispiele - mit Höchstkultur, illustren Gästen, Knall-Effekt und großen Emotionen!","description":"Es ist offensichtlich! Die krasse Ungleichverteilung von Reichtum ist das Haupthindernis bei der Bewältigung dringender sozialer Probleme, sei es nun Wohnungsmangel, prekäre Arbeitsverhältnisse, Armut oder Klimakatastrophe. In einem Modelprogramm arbeitet das Quartiersmanagement Grunewald direkt mit der schwierigen Klientel der Vermögenden, es besucht die isolierte Parallelgesellschaft im Problemkiez Berlin-Grunewald und reicht die helfende Hand! Unsere Botschaft an die oberen 10%: Der Trend geht zur Selbst-Enteignung!","recording_license":"","do_not_record":false,"persons":[{"id":12164,"public_name":"QM Grunewald"}],"links":[{"url":"https://www.youtube.com/watch?v=S8mSVbUUCKQ","title":"24h Grunewald, die Kiez Reporter"},{"url":"https://twitter.com/QMGrunewald","title":"Twitter"},{"url":"www.mygruni.de","title":"Web"}],"attachments":[]}]}},{"index":4,"date":"2020-12-30","day_start":"2020-12-30T09:00:00+01:00","day_end":"2020-12-30T23:00:00+01:00","rooms":{"rc1":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11361.html","id":11361,"guid":"5f8b1e49-59ac-442e-8515-34ed300b1504","logo":null,"date":"2020-12-30T12:40:00+01:00","start":"12:40","duration":"01:00","room":"rc1","slug":"rc3-11361-climate_tipping_points","title":"Climate Tipping Points","subtitle":"","track":"Science","type":"lecture","language":"en","abstract":"Politicians, economists and even some natural scientists have tended to assume that tipping points in the Earth system — such as the loss of the Amazon rainforest or the West Antarctic ice sheet — are of low probability and little understood. Yet evidence is mounting that these events could be more likely than was thought, have high impacts and are interconnected across different biophysical systems, potentially committing the world to long-term irreversible changes.\r\n\r\nThis talk summarizes evidence on the threat of exceeding tipping points and explores the effects of such large-scale changes, how quickly they might unfold and whether we still have any control over them.","description":"The Intergovernmental Panel on Climate Change (IPCC) introduced the idea of tipping points two decades ago. At that time, these ‘large-scale discontinuities’ in the climate system were considered likely only if global warming exceeded 5 °C above pre-industrial levels. Information summarized in the two most recent IPCC Special Reports (published in 2018 and in September 2019) suggests that tipping points could be exceeded even between 1 and 2 °C of warming (see ‘Too close for comfort’).\r\n\r\nIf current national pledges to reduce greenhouse-gas emissions are implemented — and that’s a big ‘if’ — they are likely to result in at least 3 °C of global warming. This is despite the goal of the 2015 Paris agreement to limit warming to well below 2 °C. Some economists, assuming that climate tipping points are of very low probability (even if they would be catastrophic), have suggested that 3 °C warming is optimal from a cost–benefit perspective. However, if tipping points are looking more likely, then the ‘optimal policy’ recommendation of simple cost–benefit climate-economy models aligns with those of the recent IPCC report. In other words, warming must be limited to 1.5 °C. This requires an emergency response.\r\n\r\nIn our view, the clearest emergency would be if we were approaching a global cascade of tipping points that led to a new, less habitable, ‘hothouse’ climate state. Interactions could happen through ocean and atmospheric circulation or through feedbacks that increase greenhouse-gas levels and global temperature. Alternatively, strong cloud feedbacks could cause a global tipping point.\r\n\r\nThis talk will give an overview on how these different scenarios might play out, how likely they are, and what we need to do to avoid them.","recording_license":"","do_not_record":false,"persons":[{"id":1943,"public_name":"Stefan Rahmstorf"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11484.html","id":11484,"guid":"cfd52111-4833-4580-8818-969dbe185567","logo":"/system/events/logos/000/011/484/large/Logo_RicardaWinkelmann.JPG?1605893798","date":"2020-12-30T14:00:00+01:00","start":"14:00","duration":"00:40","room":"rc1","slug":"rc3-11484-the_big_melt_tipping_points_in_greenland_and_antarctica","title":"The big melt: Tipping points in Greenland and Antarctica","subtitle":"","track":"Science","type":"lecture","language":"en","abstract":"Storing ice volumes of more than 65 meters sea-level equivalent, the ice sheets on Greenland and Antarctica are by far the largest potential source of future sea-level rise. Their long-term stability thus determines the fate of our coastal cities and cultural heritage sites. While massive in size, the ice sheets also belong to the most vulnerable parts of the Earth system: feedbacks between ice, atmosphere and ocean give rise to non-linearities in their response to progressing global warming. Once a critical temperature threshold is crossed, this could lead to self-sustained and potentially irreversible ice loss from drainage basins in Greenland and Antarctica. In this lecture, we will review the processes behind these dynamic instabilities, discuss the potential of crossing ice-sheet tipping points in the future, and explore the resulting impacts on sea-level rise and our global climate – not just for this century, but for the next millennia and beyond.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":12744,"public_name":"Ricarda Winkelmann"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11550.html","id":11550,"guid":"e78b5197-8dba-490a-a549-9e82dec025ae","logo":null,"date":"2020-12-30T15:00:00+01:00","start":"15:00","duration":"01:00","room":"rc1","slug":"rc3-11550-co2_messen_-_in_raumen_und_in_der_atmosphare","title":"CO2 Messen - in Raumen und in der Atmosphäre","subtitle":"Messmethoden für CO2-Ampel, Atmosphäre und mehr","track":"Hardware \u0026 Making","type":"lecture","language":"de","abstract":"CO2, Kohlenstoffdioxid, ist inzwischen im Bewusstsein aller angekommen. Ob als ppm Wert in der Erdatmosphäre und als Treibhausgas, oder durch die im Sommer vorgeschlagenen CO2 Ampeln. Aber: wie kann man denn die Konzentration eines unsichtbaren Gases in geriger Konzentration messen?","description":"Die \"CO2-Ampel\" hat seit August sprunghaft an Bekanntheit gewonnen, als die Konzentration von Kohlendioxid als potentieller Indikator für unzureichenden Austausch der Raumluft und damit für ein generell erhöhtes Infektionsrisiko vorgeschlagen wurde.\r\nDie prominenteste Sensorfamilie arbeitet über die Detektion der breitbandigen IR-Absorption des CO2-Moleküls, wir sehen uns IR- und Rama Spektroskopie an, wie einfache Sensoren funktionieren bis hoch zu hoch genauen industriellen Sensoren.\r\nEine weitere Detektionsmethode bieten Metalloxid Sensoren, die mit moderner MEMS-Technologie sehr kompakt gefertigt werden können und mit der Größe eines Streichholzkopfes gut geeignet für wearable Devices sind. \r\nDabei unterscheiden sich Sensoren, die tatsächlich CO2 messen können von solchen, die flüchtige organische Verbindungen (engl. volatile organic compounds, VOC) messen.\r\nEin VOC Sensor findet sich auch auf der auf dem Camp 2019 vorgestellten card10 smartwatch. Wer eine besitzt, darf gern die neueste Firmware installieren und zu Hause mit experimentieren!\r\n","recording_license":"","do_not_record":false,"persons":[{"id":9097,"public_name":"Sebastian Pischel"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11585.html","id":11585,"guid":"b57bb53f-8ef2-4310-8b9e-6189a2afb403","logo":null,"date":"2020-12-30T18:00:00+01:00","start":"18:00","duration":"01:00","room":"rc1","slug":"rc3-11585-infrastructure_review","title":"Infrastructure Review","subtitle":"","track":"Community","type":"lecture","language":"en","abstract":"This conference is run by teams of volunteers. In this event, they will provide some insight into the challenges they faced while building the infrastructure, networks, running video streams, or organizing the world map.","description":"","recording_license":"","do_not_record":false,"persons":[{"id":6777,"public_name":"ysf"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11584.html","id":11584,"guid":"cfd3a3e4-69be-4f1e-8c0c-77a06e04731a","logo":null,"date":"2020-12-30T19:20:00+01:00","start":"19:20","duration":"00:30","room":"rc1","slug":"rc3-11584-abschluss","title":"Abschluss","subtitle":"","track":"Community","type":"lecture","language":"de","abstract":"","description":"","recording_license":"","do_not_record":false,"persons":[{"id":14151,"public_name":"blubbel"}],"links":[],"attachments":[]}],"rc2":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11517.html","id":11517,"guid":"6278261f-57c2-402f-9872-4bbde449fd53","logo":null,"date":"2020-12-30T12:00:00+01:00","start":"12:00","duration":"00:40","room":"rc2","slug":"rc3-11517-covid-19_exposure_notifications","title":"COVID-19 Exposure Notifications","subtitle":"","track":"IT-Security","type":"lecture","language":"en","abstract":"The Google/Apple Exposure Notifications protocol (GAEN) and COVID-19 contact tracings apps using it are probably among the most discussed tech topics of 2020. This talk gives a summary of how GAEN works and how it is used by COVID-19 tracing apps. It also aims to provide discussion points on how these apps could be improved to make them (more) useful in a pandemic.","description":"The general concepts of the DP-3T protocol that forms the basis for GAEN has been discussed largely in media and is described even in the apps itself. I will explain the details of the GAEN protocol specifically as those are relevant to get better insights on privacy implications.\r\n\r\nI will further outline how the protocol is used in practice, i.e. how apps are using it, which role Apple and Google have. The focus of this will be on the German Corona-Warn-App and the Android operating system.\r\n\r\nIn the end, I will present some of the valid criticisms against the protocol (and its realization), recently causing politicians to ask for \"less privacy\". I will present some attempts on solutions to improve the operating system and apps to tackle some of the issues. And will tell you how getting root access to your Android phone can finally save lives.","recording_license":"","do_not_record":false,"persons":[{"id":12788,"public_name":"Marvin W."}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11573.html","id":11573,"guid":"96ea1862-1f68-4969-a540-e661346629e7","logo":null,"date":"2020-12-30T13:00:00+01:00","start":"13:00","duration":"00:40","room":"rc2","slug":"rc3-11573-corona-warn-app","title":"Corona-Warn-App","subtitle":"Unsichtbar ist nicht unscheinbar","track":"IT-Security","type":"lecture","language":"de","abstract":"Die deutsche Corona-Warn-App wurde am 16. Juni 2020 veröffentlicht und seitdem deutlich über 23 Millionen mal heruntergeladen. Datenschutz und Datensicherheit hatten und haben  einen sehr hohen Stellenwert – auch wenn diese für die meisten Nutzer unsichtbar bleiben. In diesem Vortrag wird Thomas Klingbeil, Solution Architect der Corona-Warn-App, Aspekte wie Plausible Deniability beleuchten und zeigen, wie diese während der Entwicklung die Architektur des Gesamtsystems beeinflusst haben und weiterhin beeinflussen.","description":"Wenn wir die Umsetzung einer App betrachten, wird oft das  Backend vernachlässigt. Dabei muss gerade an dieser Stelle und bei der Kommunikation der Komponenten stark darauf geachtet werden, dass sich durch eine Beobachtung des Datenverkehrs keine Rückschlüsse auf die spezifische Situation von Nutzer*innen oder deren Verhalten ziehen lassen. Bei der Corona-Warn-App geht es hierbei insbesondere um den Teststatus bzw. das Teilen der eigenen Diagnoseschlüssel im Falle eines positiven Testergebnisses. Um Nutzer zu schützen (d.h. glaubhafte Abstreitbarkeit/Plausible Deniability zu erzeugen), kommt bei der Corona-Warn-App ein Playbook zum Einsatz, das an vielen Stellen des Systems eine glaubhafte Kommunikation zwischen den einzelnen Komponenten simuliert. In diesem Vortrag wird Thomas Klingbeil diese und andere meist unsichtbare Aspekte in der Entwicklung beleuchten.","recording_license":"","do_not_record":false,"persons":[{"id":12775,"public_name":"Thomas Klingbeil"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11364.html","id":11364,"guid":"8f3ef0f5-4929-48b1-87b7-781245aae7ac","logo":"/system/events/logos/000/011/364/large/n00dl0r.jpg?1605117415","date":"2020-12-30T14:00:00+01:00","start":"14:00","duration":"00:40","room":"rc2","slug":"rc3-11364-i_could_not_resist","title":"I could not resist","subtitle":"Resists for Electron Beam Lithography (EBL)","track":"Hardware \u0026 Making","type":"lecture","language":"en","abstract":"Photoresists are one of the essential ingredients for chip manufacturing and micro/nano engineering.\r\nWe will show how we’re using them in a DIY Electron Beam Lithography set-up and how you’re able to cook your own cheap resists and mix your own developers.","description":"\u003c!DOCTYPE html\u003e\r\n\u003chtml\u003e\r\n\u003cbody\u003e\r\n\u003ch2\u003eResists? What\u0026apos;s that?\u003c/h2\u003e\r\n\u003cul\u003e\r\n    \u003cli\u003eWhat are their applications\u003c/li\u003e\r\n    \u003cli\u003eHow does it work (types (positive/negative), chemistry, proximity effect, dosage etc)\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003ch2\u003eEBL? What\u0026apos;s that?\u003c/h2\u003e\r\n\u003cul\u003e\r\n    \u003cli\u003eHow does it work\u003c/li\u003e\r\n    \u003cli\u003ePros \u0026amp; cons:  comparison between EBL (slow) photolithography (fast)\u003c/li\u003e\r\n    \u003cli\u003eWhich resist can I use for EBL\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003ch2\u003eDIY cooking of PMMA based resists\u003c/h2\u003e\r\n\u003cul\u003e\r\n    \u003cli\u003eComparison of different solvents\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003ch2\u003eComposition of different developers\u003c/h2\u003e\r\n\u003cul\u003e\r\n    \u003cli\u003eComparison of different developers\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003ch2\u003eApplications\u003c/h2\u003e\r\n\u003cul\u003e\r\n    \u003cli\u003eUsage as a mask\u003c/li\u003e\r\n    \u003cli\u003eUsage as a structural dielectric material\u003c/li\u003e\r\n    \u003cli\u003e ...(?)\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\u003ch2\u003eThe EBL exposure process\u003c/h2\u003e\r\n\u003cul\u003e\r\n    \u003cli\u003esimple SEM retrofitted with an EBL controller\u003c/li\u003e\r\n    \u003cli\u003eThe common file formats (GDSII \u0026amp; OASIS)\u003c/li\u003e\r\n    \u003cli\u003eScan-Gen: how to generate the proper curves for the exposure\u003c/li\u003e\r\n    \u003cli\u003eHardware: off-the-shelf embedded modules like the RedPitaya\u003c/li\u003e\r\n    \u003cli\u003eGeneration of different filling curve styles, calibration, compensation of the proximity effect, correction of the SEMs intrinsic parameters, dosage!\u003c/li\u003e\r\n    \u003cli\u003eFiducial detection and alignment for multi-pass/multi-layer processes\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\u003ch2\u003eStuff comes together\u003c/h2\u003e\r\n\u003cul\u003e\r\n    \u003cli\u003ewalk through the complete process along a simple example\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003ch2\u003eMore Examples\u003c/h2\u003e\r\n\r\n\u003ch2\u003eThanks \u0026 Credits\u003c/h2\u003e\r\n\r\n\u003ch2\u003eQ \u0026 A\u003c/h2\u003e\r\n\r\n\u003c/body\u003e\r\n\u003c/html\u003e\r\n","recording_license":"","do_not_record":false,"persons":[{"id":12148,"public_name":"N00DL3"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11343.html","id":11343,"guid":"d8ede9af-e375-448d-aab8-bc2d1f5f7ae3","logo":"/system/events/logos/000/011/343/large/3000x3000-1.jpg?1604735780","date":"2020-12-30T15:00:00+01:00","start":"15:00","duration":"01:00","room":"rc2","slug":"rc3-11343-ruckblick_auf_ein_turbulentes_jahr_digitale_schule","title":"Rückblick auf ein turbulentes Jahr digitale Schule","subtitle":"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"Ich habe mich ein Jahr in meinem Podcast mit den Fragen digitaler Bildung auseinandersetzen müssen. Pünktlich im März dieses Jahres wurde das von der Theorie in die Praxis geholt.","description":"Ich habe mich ein Jahr in meinem Podcast mit den Fragen digitaler Bildung auseinandersetzen müssen. Pünktlich im März dieses Jahres wurde das von der Theorie in die Praxis geholt. Wie sich theoretische und praktische Überlegungen bei der Bewältigung einer neuen, und nicht nur pandemischen, Schulrealität die Hand geben und welche Möglichkeitsräume sich hier eröffnen sind die Themen dieses Vortrags.","recording_license":"","do_not_record":false,"persons":[{"id":9212,"public_name":"Thomas 'advi' Brandt"}],"links":[],"attachments":[]}],"chaosstudio-hamburg":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11594.html","id":11594,"guid":"9b15e337-2467-4ccf-9ce8-8113c7f0de8c","logo":null,"date":"2020-12-30T12:00:00+01:00","start":"12:00","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11594-a_did-method_for_blobaa_enabling_ssi_interoperability_byo_did_method","title":"A DID-Method for Blobaa: enabling SSI interoperability \u0026 BYO DID method","subtitle":"","track":"IT-Security","type":"lecture","language":"en","abstract":"In this talk, we will present the bba DID method and how it fits into the Trust over Ip Stack (SSI Stack)","description":"","recording_license":"","do_not_record":false,"persons":[{"id":14141,"public_name":"Martin Maurer"},{"id":14142,"public_name":"Attila Aldemir"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11593.html","id":11593,"guid":"cfca65c9-75e8-459b-8976-651dcc487908","logo":null,"date":"2020-12-30T13:00:00+01:00","start":"13:00","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11593-ssi_in_hamburg_real-world_applications_of_self-sovereign_identities","title":"SSI in Hamburg: real-world applications of self-sovereign identities","subtitle":"","track":null,"type":"lecture","language":"en","abstract":"In this talk, we will present some ideas how SSI could change – and drastically simplify – interactions in the real world.","description":"In this talk, we will present some ideas how SSI could change – and drastically simplify – interactions in the real world. We will focus on mobility, but also touch upon why public services are a necessary ingredient. A key challenge is identified: how to motivate widespread use, and you are invited to join the discussion. ","recording_license":"","do_not_record":false,"persons":[{"id":14140,"public_name":"Hartmut Obendorf "}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11526.html","id":11526,"guid":"1d9529e4-5b8a-4eca-8f98-6477b681caf6","logo":null,"date":"2020-12-30T15:00:00+01:00","start":"15:00","duration":"01:00","room":"chaosstudio-hamburg","slug":"rc3-11526-the_state_of_digital_rights_in_latin_america","title":"The state of digital rights in Latin America","subtitle":"","track":"Ethics, Society \u0026 Politics","type":"other","language":"en","abstract":"Oftentimes, we read about the state of digital rights on the Global North and their challenges, but we hear little from the Global South. What is, then, the state of digital rights on the Global South and, specially, in Latin America? Are those rights threatened in the same way that they are in the Global North? Do those rights apply in the same way? On this talk, we will explore these questions. We will touch upon the history of digital censorship in Latin America, how it has evolved, and how surveillance in the region is increasing.","description":"Perhaps one of the biggest challenges that we have as a community is the fact that we hear little from the perspectives from other regions of the world that are often consuming the technology and ideas produced from the Global North. This talk will aim to bring the Latin American perspective to the table: to talk about the state of digital rights in the region, about the challenges facing towards a digital sovereignty, about the state of digital rights from a legal and political perspective, and more.","recording_license":"","do_not_record":false,"persons":[{"id":8357,"public_name":"Sofia Celi"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11511.html","id":11511,"guid":"14229ea8-0003-4665-9e02-faaf733bd0e8","logo":null,"date":"2020-12-30T16:10:00+01:00","start":"16:10","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11511-watching_the_watchers_-_how_surveillance_companies_track_you_using_mobile_networks","title":"Watching the Watchers - How Surveillance Companies track you using Mobile Networks ","subtitle":"Real life experiences from the Location Tracking Wars  ","track":"IT-Security","type":"lecture","language":"en","abstract":"Every day, surveillance companies attack mobile networks, attempting to track the location of mobile phone users. We will analyze, using real-life data, these surveillance companies’ tactics and show the different ways that users are tracked in the wild over 2G, 3G and 4G networks. For 5G, we describe the critical functions and information elements in the core network that might be targeted by these attackers.","description":"Mobile core signaling networks have been known to have exploitable vulnerabilities for several years. However very little information has been presented on whether these vulnerabilities are being exploited in real-life or not, and if so, how it is being done. This presentation will give first-hand information about how location tracking – the most common form of mobile signaling attack - is being done over multiple types of mobile networks in the wild today.\r\nWe will start with briefly introducing mobile telecom networks, their known security flaws and how surveillance companies exploit these flaws. Surveillance companies are success oriented and have a toolbox which they use for location tracking of mobile phone users, which is the most common attack. Based on real-life experiences we will describe what “tools” we see in the wild and how they work. We will also describe how attackers optimize attacks based on the target network and technology, and how attacks have changed over time since some mobile operators have begun to put in place protections. We will also show a visualization of how these attacks can happen. Finally, we will make a projection for 5G core networks, and how they will also be targeted by surveillance companies as they are deployed globally over the next few years. ","recording_license":"","do_not_record":false,"persons":[{"id":12801,"public_name":"Cathal Mc Daid"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11365.html","id":11365,"guid":"3a543c0f-abcc-4b07-aeff-c8051fabc838","logo":"/system/events/logos/000/011/365/large/logo.png?1605175843","date":"2020-12-30T17:00:00+01:00","start":"17:00","duration":"00:40","room":"chaosstudio-hamburg","slug":"rc3-11365-lvi_hijacking_transient_execution_through_microarchitectural_load_value_injection","title":"LVI: Hijacking Transient Execution through Microarchitectural Load Value Injection","subtitle":"","track":"IT-Security","type":"lecture","language":"en","abstract":"Load Value Injection (LVI) is a new class of transient-execution attacks exploiting microarchitectural flaws in modern processors to inject attacker data into a victim program and steal sensitive data and keys from Intel SGX, a secure vault in Intel processors for your personal data. ","description":"Since 2018, we have seen an alarming wave of Meltdown-type attacks: from the\r\noriginal Meltdown, breaking kernel isolation, over Foreshadow, breaking virtual\r\nmachine and SGX enclave isolation, to most recently ZombieLoad, breaking\r\nessentially all of these. All of these attacks exploit CPU vulnerabilities to\r\nleak data, breaking basically all confidentiality guarantees of CPUs. Luckily,\r\nthere are already widely deployed countermeasures -- either in hardware or\r\nsoftware -- preventing exploitation of these attacks.\r\n\r\nIn this talk, we show that despite all countermeasures, the Meltdown effect can\r\nbe turned around to inject attacker-controlled data into the microarchitectural\r\nstate of any application. This technique, called Load Value Injection (LVI),\r\nsmuggles the attacker's data through hidden processor buffers into a victim\r\nprogram and allows to hijack both transient control flow as well as the data\r\nflow. By forcing a (microarchitectural) fault in the victim, the victim\r\ntransiently calculates on maliciously injected data. Especially in the case of\r\ntrusted execution environments, such as Intel SGX, where an attacker has full\r\ncontrol of the operating system, adversaries can easily trigger a fault in the\r\nvictim and leak arbitrary enclave secrets. We show that this can be exploited\r\nfor all CPUs that were affected by some variant of Meltdown.\r\nAs a result, we can bypass existing Meltdown countermeasures,\r\narbitrarily change control flow, and let the application work on\r\nattacker-controlled data.\r\n\r\nWe outline the drastic consequences for affected CPUs. After nearly 1\r\nyear of embargo, fully mitigating our attacks requires serializing the\r\nprocessor pipeline with memory fence instructions after possibly every\r\nmemory load. Additionally and even worse, due to implicit loads on some\r\narchitectures, specific instructions have to be blacklisted, including\r\nthe ubiquitous x86 ret instruction. Intel's compiler mitigations lead to\r\nperformance impacts of factor 2 to 19. In a demo, we show how LVI can be\r\nused to leak a cryptographic key.\r\n\r\nFor more information about our work, including demo videos and a\r\ntrailer, see: \u003chttps://lviattack.eu/\u003e\r\n\r\nA technical paper about this work appeared at IEEE S\u0026P 2020 and is\r\navailable here: \u003chttps://lviattack.eu/lvi.pdf\u003e\r\n","recording_license":"","do_not_record":false,"persons":[{"id":12439,"public_name":"Jo Van Bulck"},{"id":8665,"public_name":"Michael Schwarz"}],"links":[{"url":"https://lviattack.eu/","title":"Homepage"},{"url":"https://software.intel.com/security-software-guidance/deep-dives/deep-dive-load-value-injection","title":"Intel Deep Dive"},{"url":"https://www.intel.com/content/www/us/en/security-center/advisory/intel-sa-00334.html","title":"Intel Security Advisory"},{"url":"https://youtu.be/baKHSXeIIaI","title":"Inception-inspired trailer video"}],"attachments":[{"url":"/system/event_attachments/attachments/000/004/149/original/lvi.pdf?1605175843","title":"Technical paper"}]}],"restrealitaet":[{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11587.html","id":11587,"guid":"aa336ee4-0405-47fb-8169-550403f98f14","logo":"/system/events/logos/000/011/587/large/health_angel.jpg?1607465962","date":"2020-12-30T12:00:00+01:00","start":"12:00","duration":"01:00","room":"restrealitaet","slug":"rc3-11587-uber_mutierte_viren_todliche_impfungen_und_den_taglichen_wahnsinn_in_der_notaufnahme","title":"Über mutierte Viren, tödliche Impfungen und den täglichen Wahnsinn in der Notaufnahme","subtitle":"Medizinisch-wissenschaftliche Hintergrundinformationen zur Corona Pandemie aus einer aktivistisch regierungskritischen Perspektive","track":"Science","type":"lecture","language":"de","abstract":"Medizinisch-wissenschaftliche Hintergrundinformationen zur Corona Pandemie aus einer radikal aktivistischen und regierungskritischen Perspektive. ","description":"Gefährliches Halbwissen, mißinterpretierte Statistiken und richtige Fakten, mit denen falsch argumentiert wird, bestimmen den öffentlichen Diskurs über die Corona Pandemie und ihre Auswirkungen. Medizinisches Wissen, Epidemiologie, Statistik, gesellschaftliche und wirtschaftliche Auswirkungen, sowie politische Stellungnahmen werden wild durcheinander geworfen und die absurdesten Zusammenhänge gezogen. In diesem Vortrag sollen die wichtigsten medizinischen Grundlagen zur aktuellen Pandemie vereinfacht dargelegt (immunologisch, infektiologisch und intensivmedizinisch), ein Blick auf die weltweite Geschichte der Pandemien geworfen, kurz das Themengebiet Statistik gestreift und Einblicke in den Alltag in einem Level-2-Corona-Krankenhauses gegeben werden. \r\nAuf der Basis dieser wissenschaftlichen Perspektive einer Medizinerin mit der praktischen Erfahrung einer Krankenhaus-Angestellten soll ein Input aus der Perspektive einer regierungskritische Aktivistin gegeben werden. Schon immer waren die Bereiche Antikapitalismus, Antirassismus, gesundheitspolitische (Un)Gerechtigkeit und der Kampf gegen die Privatisierung des Krankenhaussystems und die Macht der Pharmakonzerne die Kernthemen der Referentin. Heute soll es darum gehen, diese Themen in der aktuellen Debatte (ohne ein Abrutschen in die Schwurblerecke) weiterhin hochzuhalten und einen Weg der wissenschaftlichen Rationalität mit Kritik an der Regierung und dem Gesundheitssystem aufzuzeigen.\r\n\r\n","recording_license":"","do_not_record":false,"persons":[{"id":13637,"public_name":"Dr. med. Elisa Stein"}],"links":[],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11416.html","id":11416,"guid":"4b3c4e5a-8c7a-4fc3-a43a-bc3ed1cbbf13","logo":"/system/events/logos/000/011/416/large/csm_savedFrame04582_5_web_2fd5bb3177.jpg?1605793435","date":"2020-12-30T14:00:00+01:00","start":"14:00","duration":"01:00","room":"restrealitaet","slug":"rc3-11416-von_schleimpilzen_und_biohacking","title":"Von Schleimpilzen und Biohacking","subtitle":"Eine interdisziplinäre Studie zu allem was wächst und wurzelt","track":"Science","type":"lecture","language":"de","abstract":"Die Medienkünstlerin Theresa Schubert schafft es mit ihren transdiziplinären Arbeiten das feine Bindegewebe zwischen Mensch/Natur auf der einen, und Wissenschaft/Technik auf der anderen Seite sichtbar und vor allem erfahrbar zu machen. Oft sind dabei organische Materialen wie z.B. (Schleim-)Pilze der Ausgangspunkt für eine experimentelle Auseinandersetzung mit Praktiken von posthumanistische Selbstorganisation oder artenübergreifender Kommunikation. In ihrem Vortrag wird sie über ihre Arbeitsweise bzw. Ihren methodischen Ansätze - wie z.B. Biohacking, theoretischer Analyse, oder performativer Interpretation sprechen. ","description":"","recording_license":"","do_not_record":false,"persons":[{"id":13628,"public_name":"Theresa Schubert"}],"links":[{"url":"http://theresaschubert.com","title":"Theresa Schubert - Homepage"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11590.html","id":11590,"guid":"b6d3ede9-da9a-4ee0-9fc1-486d0eff2d12","logo":"/system/events/logos/000/011/590/large/sonar_header.jpg?1607946633","date":"2020-12-30T16:00:00+01:00","start":"16:00","duration":"01:00","room":"restrealitaet","slug":"rc3-11590-ballern_3_0_create_a_safer_party","title":"Ballern 3.0 – create a safer party","subtitle":"","track":"Art \u0026 Culture","type":"lecture","language":"de","abstract":"Sonar – Safer nightlife Berlin steht für safer use und safer spaces im nightlife.  Was muss ich wissen, wenn ich im nightlife Drogen nehme - wie mach ich's so richtig?","description":"Ein kurzer Input verschafft euch einen Überblick - welche Nightlife Projekte gibt es und um welche Inhalte geht es dabei? Wo können sich User*innen und Clubbetreibende/ Kulturschaffende informieren? Was sind die wichtigsten Basics. Im Anschluss wird es auch Zeit für Fragen geben. ","recording_license":"","do_not_record":false,"persons":[{"id":13723,"public_name":"Andrea Piest"}],"links":[{"url":"https://safer-nightlife.berlin/","title":"Sonar "}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11367.html","id":11367,"guid":"d7863458-8500-4753-8e2e-7d0d2c1e8391","logo":"/system/events/logos/000/011/367/large/Bildschirmfoto_2020-11-12_um_13.30.23.png?1605184765","date":"2020-12-30T18:00:00+01:00","start":"18:00","duration":"01:00","room":"restrealitaet","slug":"rc3-11367-inside_xhamster","title":"Inside xHamster","subtitle":"Undercover im Löschteam von Deutschlands meistbesuchter Pornoseite","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"xHamster ist die meistbesuchte Pornoseite Deutschlands und eine der meistbesuchten Websites der Welt. Aber was tut xHamster dagegen, dass dort Aufnahmen sexualisierter Gewalt kursieren? Kritische Fragen zu dem Thema blockt die Firma hinter xHamster konsequent ab. Also haben wir uns dort undercover als Löscharbeiter beworben und uns ein eigenes Bild gemacht. Nach wochenlangem Social Engineering und mehreren Monaten Recherche wissen wir: xHamster schützt Opfer von sexualisierter und digitaler Gewalt nur mangelhaft. Die Ergebnisse der Recherche “Inside xHamster” haben wir in einer Artikelserie auf VICE.com veröffentlicht.","description":"Wochenlang haben wir undercover als Löscharbeiter für xHamster gearbeitet und mutmaßlich illegale Fotos aussortiert. Wir waren Teil eines Teams aus offenbar mehr als 100 Freiwilligen, die anonym und ohne Bezahlung über sensible Inhalte entscheiden. Neben den Freiwilligen gibt es noch ein Support-Team aus bezahlten xHamster-Mitarbeitern, über dessen Arbeit die Plattform wenig verrät.\r\n\r\nEin Anfangsverdacht reicht nicht aus, um eine Aufnahme zu löschen. Ob mutmaßliche Vergewaltigung oder bildbasierte, sexualisierte Gewalt: Verdächtige Fotos sollen die Löscharbeiter nur entfernen, wenn sie sich zu 100 Prozent sicher sind, dass sie gegen die Regeln von xHamster verstoßen. Bewerten können sie die Fotos aber nur nach Augenschein.\r\n\r\nDas hat drastische Folgen, zum Beispiel für den Kampf gegen strafbare Jugendpornografie. Die Löscharbeiter von xHamster müssen aus dem Bauch heraus entscheiden, ob eine fremde Person schon volljährig ist oder nicht. Entfernen sollen sie ein verdächtiges Foto nur, wenn sie die Wahrscheinlichkeit, dass die abgebildete Person unter 18 ist, subjektiv als \"hoch\" einstufen. Minderjährige können also nur geschützt werden, wenn sie kindlich genug aussehen.\r\n\r\nDas und mehr geht aus dem internen Regelwerk von xHamster hervor, das wir auf VICE.com veröffentlicht haben. Es besteht im Kern aus lediglich rund 2.800 Zeichen und 38 Beispielfotos.\r\n\r\nxHamster hat auf unseren Katalog aus 67 Fragen nur mit knappen Statements reagiert. Unsere Fragen zum Regelwerk der Löscharbeiter wurden inhaltlich nicht beantwortet – wie ein Sprecher mitteilte aus \"technischen Gründen\" und aus Gründen der \"Sicherheit\". Wir sollten \"versichert\" sein, dass \"Kontrollen existieren\". Wenn etwas gegen die Nutzungsbedingungen verstoße, werde es entfernt.\r\n\r\nDas Justizministerium teilt vor dem Hintergrund der Recherche mit, Anbieter dürften sich nicht durch \"bewusstes Wegschauen\" einer Verantwortlichkeit entziehen. Ein derzeit geplantes Gesetzespaket auf EU-Ebene, der \"Digital Services Act\", könnte Pornoplattformen wie xHamster strenger in die Pflicht nehmen. Unterm Strich existiert derzeit aber kein wirksamer Schutz für Betroffene.\r\n\r\nDa es aktuell nicht einmal Meldepflichten für Rechtsverstöße auf Pornoplattformen gibt, kann die Öffentlichkeit das Ausmaß sexualisierter und digitaler Gewalt im Netz nur erahnen. Die Recherche bietet erstmals Einblicke in den Maschinenraum einer der größten Pornoplattformen der Welt.","recording_license":"","do_not_record":false,"persons":[{"id":12197,"public_name":"Sebastian Meineck"},{"id":13869,"public_name":"Yannah Alfering"}],"links":[{"url":"https://www.vice.com/de/topic/inside-xhamster","title":"Inside xHamster: Die Recherche hinter den Kulissen von Deutschlands meistbesuchter Pornoseite"}],"attachments":[]},{"url":"https://fahrplan.events.ccc.de/rc3/2020/Fahrplan/events/11592.html","id":11592,"guid":"9add7cd1-b5be-4942-8c29-e968f76bb91e","logo":null,"date":"2020-12-30T20:00:00+01:00","start":"20:00","duration":"00:40","room":"restrealitaet","slug":"rc3-11592-die_suche_nach_dem_alten_weissen_mann","title":"Die Suche nach dem Alten Weißen Mann","subtitle":"","track":"Ethics, Society \u0026 Politics","type":"lecture","language":"de","abstract":"In dringender Angelegenheit: Die Welt ist an einem Wendepunkt. Wer übernimmt die Führung? Wer putzt heute das Klo? Wer holt uns eine Happy Pizza?","description":"","recording_license":"","do_not_record":false,"persons":[{"id":9375,"public_name":"niczem"},{"id":13840,"public_name":"Sophie Krause"},{"id":13839,"public_name":"Carolijn Terwindt"}],"links":[],"attachments":[]}]}}]}}}